{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          3
        ],
        "tokens": [
          "[EOS]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "!": 4,
      "'": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "?": 23,
      "A": 24,
      "B": 25,
      "C": 26,
      "D": 27,
      "E": 28,
      "F": 29,
      "G": 30,
      "H": 31,
      "I": 32,
      "J": 33,
      "K": 34,
      "L": 35,
      "M": 36,
      "N": 37,
      "O": 38,
      "P": 39,
      "Q": 40,
      "R": 41,
      "S": 42,
      "T": 43,
      "U": 44,
      "V": 45,
      "W": 46,
      "X": 47,
      "Y": 48,
      "Z": 49,
      "[": 50,
      "]": 51,
      "a": 52,
      "b": 53,
      "c": 54,
      "d": 55,
      "e": 56,
      "f": 57,
      "g": 58,
      "h": 59,
      "i": 60,
      "j": 61,
      "k": 62,
      "l": 63,
      "m": 64,
      "n": 65,
      "o": 66,
      "p": 67,
      "q": 68,
      "r": 69,
      "s": 70,
      "t": 71,
      "u": 72,
      "v": 73,
      "w": 74,
      "x": 75,
      "y": 76,
      "z": 77,
      "|": 78,
      "،": 79,
      "؟": 80,
      "ء": 81,
      "آ": 82,
      "أ": 83,
      "ؤ": 84,
      "إ": 85,
      "ئ": 86,
      "ا": 87,
      "ب": 88,
      "ة": 89,
      "ت": 90,
      "ث": 91,
      "ج": 92,
      "ح": 93,
      "خ": 94,
      "د": 95,
      "ذ": 96,
      "ر": 97,
      "ز": 98,
      "س": 99,
      "ش": 100,
      "ص": 101,
      "ض": 102,
      "ط": 103,
      "ظ": 104,
      "ع": 105,
      "غ": 106,
      "ـ": 107,
      "ف": 108,
      "ق": 109,
      "ك": 110,
      "ل": 111,
      "م": 112,
      "ن": 113,
      "ه": 114,
      "و": 115,
      "ى": 116,
      "ي": 117,
      "ً": 118,
      "ّ": 119,
      "ال": 120,
      "er": 121,
      "ar": 122,
      "in": 123,
      "he": 124,
      "on": 125,
      "فر": 126,
      "an": 127,
      "جع": 128,
      "جعفر": 129,
      "am": 130,
      "th": 131,
      "Ja": 132,
      "af": 133,
      "is": 134,
      "Jaaf": 135,
      "Jaafar": 136,
      "ro": 137,
      "نا": 138,
      "ور": 139,
      "من": 140,
      "في": 141,
      "ec": 142,
      "Py": 143,
      "or": 144,
      "ve": 145,
      "thon": 146,
      "Python": 147,
      "at": 148,
      "en": 149,
      "بر": 150,
      "ري": 151,
      "as": 152,
      "لة": 153,
      "عل": 154,
      "ou": 155,
      "ing": 156,
      "pro": 157,
      "al": 158,
      "de": 159,
      "مج": 160,
      "lo": 161,
      "ست": 162,
      "ed": 163,
      "شه": 164,
      "لشه": 165,
      "ورق": 166,
      "لشهب": 167,
      "ورقلة": 168,
      "ات": 169,
      "برمج": 170,
      "st": 171,
      "ic": 172,
      "the": 173,
      "أنا": 174,
      "and": 175,
      "la": 176,
      "Lec": 177,
      "heb": 178,
      "heheb": 179,
      "Lecheheb": 180,
      "arg": 181,
      "gr": 182,
      "جز": 183,
      "Ou": 184,
      "it": 185,
      "ائ": 186,
      "velo": 187,
      "argla": 188,
      "Ouargla": 189,
      "velop": 190,
      "عم": 191,
      "develop": 192,
      "ter": 193,
      "اس": 194,
      "جزائ": 195,
      "us": 196,
      "هو": 197,
      "eri": 198,
      "amm": 199,
      "gramm": 200,
      "il": 201,
      "programm": 202,
      "ام": 203,
      "خد": 204,
      "مي": 205,
      "ني": 206,
      "ستخد": 207,
      "اص": 208,
      "ent": 209,
      "you": 210,
      "دي": 211,
      "Al": 212,
      "geri": 213,
      "با": 214,
      "Algeri": 215,
      "مبرمج": 216,
      "02": 217,
      "for": 218,
      "عي": 219,
      "es": 220,
      "ang": 221,
      "بي": 222,
      "طور": 223,
      "شا": 224,
      "Fl": 225,
      "تعل": 226,
      "rom": 227,
      "ستخدم": 228,
      "Wh": 229,
      "from": 230,
      "ce": 231,
      "ion": 232,
      "te": 233,
      "ما": 234,
      "وي": 235,
      "وال": 236,
      "DZ": 237,
      "Dic": 238,
      "ac": 239,
      "bu": 240,
      "oDZ": 241,
      "ts": 242,
      "ذك": 243,
      "الجزائ": 244,
      "ask": 245,
      "DicoDZ": 246,
      "ear": 247,
      "of": 248,
      "الم": 249,
      "عمل": 250,
      "My": 251,
      "ence": 252,
      "nam": 253,
      "اء": 254,
      "سي": 255,
      "طنا": 256,
      "art": 257,
      "اسمي": 258,
      "اصطنا": 259,
      "ذكاء": 260,
      "اصطناعي": 261,
      "23": 262,
      "li": 263,
      "re": 264,
      "لي": 265,
      "developer": 266,
      "buil": 267,
      "ab": 268,
      "my": 269,
      "no": 270,
      "ss": 271,
      "to": 272,
      "ut": 273,
      "تط": 274,
      "وا": 275,
      "we": 276,
      "مت": 277,
      "ول": 278,
      "hess": 279,
      "على": 280,
      "programmer": 281,
      "Algerian": 282,
      "Dj": 283,
      "mo": 284,
      "wor": 285,
      "بني": 286,
      "نة": 287,
      "نج": 288,
      "الاصطناعي": 289,
      "برمجة": 290,
      "programming": 291,
      "ango": 292,
      "build": 293,
      "Django": 294,
      "He": 295,
      "ol": 296,
      "رنج": 297,
      "شط": 298,
      "كن": 299,
      "لغ": 300,
      "Flut": 301,
      "work": 302,
      "شطرنج": 303,
      "Flutter": 304,
      "202": 305,
      "jec": 306,
      "أت": 307,
      "سنة": 308,
      "مر": 309,
      "ers": 310,
      "out": 311,
      "شاري": 312,
      "AI": 313,
      "ial": 314,
      "خص": 315,
      "عد": 316,
      "عر": 317,
      "projec": 318,
      "ity": 319,
      "الجزائر": 320,
      "name": 321,
      "about": 322,
      "2021": 323,
      "ge": 324,
      "om": 325,
      "pl": 326,
      "ud": 327,
      "ur": 328,
      "ux": 329,
      "عن": 330,
      "مه": 331,
      "مشاري": 332,
      "ation": 333,
      "جزائري": 334,
      "Who": 335,
      "002": 336,
      "2002": 337,
      "ment": 338,
      "اض": 339,
      "حب": 340,
      "لا": 341,
      "يات": 342,
      "الج": 343,
      "البرمجة": 344,
      "رياض": 345,
      "form": 346,
      "Sc": 347,
      "chess": 348,
      "se": 349,
      "sp": 350,
      "أستخدم": 351,
      "بد": 352,
      "تم": 353,
      "مطور": 354,
      "هي": 355,
      "الأ": 356,
      "ther": 357,
      "stud": 358,
      "Algeria": 359,
      "earn": 360,
      "im": 361,
      "آلي": 362,
      "أد": 363,
      "أبني": 364,
      "إعل": 365,
      "رة": 366,
      "لل": 367,
      "ية": 368,
      "الذكاء": 369,
      "منص": 370,
      "web": 371,
      "خصص": 372,
      "projects": 373,
      "إعلام": 374,
      "AP": 375,
      "age": 376,
      "his": 377,
      "me": 378,
      "يا": 379,
      "وير": 380,
      "تطوير": 381,
      "API": 382,
      "di": 383,
      "fa": 384,
      "learn": 385,
      "nd": 386,
      "ri": 387,
      "تي": 388,
      "ذا": 389,
      "مو": 390,
      "ase": 391,
      "development": 392,
      "use": 393,
      "your": 394,
      "تعلم": 395,
      "ويب": 396,
      "ach": 397,
      "لغة": 398,
      "مشاريع": 399,
      "منصة": 400,
      "19": 401,
      "AM": 402,
      "Him": 403,
      "IN": 404,
      "KIN": 405,
      "TAM": 406,
      "ap": 407,
      "ex": 408,
      "fic": 409,
      "ho": 410,
      "ience": 411,
      "ll": 412,
      "uage": 413,
      "year": 414,
      "أن": 415,
      "انا": 416,
      "تخصص": 417,
      "حسي": 418,
      "قاص": 419,
      "كل": 420,
      "الب": 421,
      "are": 422,
      "atform": 423,
      "all": 424,
      "love": 425,
      "start": 426,
      "باح": 427,
      "anguage": 428,
      "شاب": 429,
      "Flask": 430,
      "مرباح": 431,
      "omp": 432,
      "Science": 433,
      "Himam": 434,
      "TAMKIN": 435,
      "حسين": 436,
      "قاصدي": 437,
      "Comp": 438,
      "ES": 439,
      "LL": 440,
      "Lin": 441,
      "ir": 442,
      "iz": 443,
      "ith": 444,
      "ly": 445,
      "ng": 446,
      "sc": 447,
      "ser": 448,
      "uter": 449,
      "wer": 450,
      "was": 451,
      "أل": 452,
      "تر": 453,
      "ذج": 454,
      "عة": 455,
      "هم": 456,
      "يعمل": 457,
      "الشطرنج": 458,
      "ecial": 459,
      "user": 460,
      "young": 461,
      "What": 462,
      "الجزائري": 463,
      "now": 464,
      "platform": 465,
      "student": 466,
      "exp": 467,
      "Computer": 468,
      "LLM": 469,
      "Linux": 470,
      "BO": 471,
      "Git": 472,
      "If": 473,
      "User": 474,
      "ave": 475,
      "et": 476,
      "gh": 477,
      "know": 478,
      "ls": 479,
      "language": 480,
      "mat": 481,
      "uc": 482,
      "und": 483,
      "ver": 484,
      "أس": 485,
      "أست": 486,
      "إذا": 487,
      "ار": 488,
      "تح": 489,
      "سا": 490,
      "سأل": 491,
      "قات": 492,
      "مستخدم": 493,
      "الويب": 494,
      "end": 495,
      "ast": 496,
      "بيقات": 497,
      "تعلي": 498,
      "asks": 499,
      "تطبيقات": 500,
      "building": 501,
      "special": 502,
      "rip": 503,
      "started": 504,
      "ESBO": 505,
      "In": 506,
      "Kas": 507,
      "Mer": 508,
      "ah": 509,
      "be": 510,
      "base": 511,
      "bah": 512,
      "do": 513,
      "ific": 514,
      "ma": 515,
      "sion": 516,
      "swer": 517,
      "أحب": 518,
      "أتعلم": 519,
      "إل": 520,
      "اذ": 521,
      "ان": 522,
      "حتر": 523,
      "خبر": 524,
      "فالج": 525,
      "كرة": 526,
      "لت": 527,
      "لدي": 528,
      "نف": 529,
      "ها": 530,
      "answer": 531,
      "orn": 532,
      "ile": 533,
      "ستخدام": 534,
      "باي": 535,
      "ack": 536,
      "واب": 537,
      "old": 538,
      "عرف": 539,
      "رياضيات": 540,
      "father": 541,
      "years": 542,
      "specializ": 543,
      "Kasdi": 544,
      "Merbah": 545,
      "إلى": 546,
      "فالجواب": 547,
      "Fi": 548,
      "Fast": 549,
      "Hus": 550,
      "Ter": 551,
      "bers": 552,
      "ball": 553,
      "born": 554,
      "bile": 555,
      "ch": 556,
      "dat": 557,
      "gence": 558,
      "have": 559,
      "lli": 560,
      "ms": 561,
      "ode": 562,
      "vers": 563,
      "with": 564,
      "ybers": 565,
      "أطور": 566,
      "أعمل": 567,
      "اً": 568,
      "بت": 569,
      "بش": 570,
      "بنا": 571,
      "سلة": 572,
      "شر": 573,
      "طالب": 574,
      "فهم": 575,
      "مع": 576,
      "نعم": 577,
      "نما": 578,
      "هل": 579,
      "الك": 580,
      "المبرمج": 581,
      "erst": 582,
      "inte": 583,
      "ecur": 584,
      "prof": 585,
      "educ": 586,
      "using": 587,
      "امعة": 588,
      "مية": 589,
      "باستخدام": 590,
      "تعلمت": 591,
      "teach": 592,
      "asket": 593,
      "live": 594,
      "reat": 595,
      "rebase": 596,
      "not": 597,
      "tool": 598,
      "mode": 599,
      "sein": 600,
      "بدأت": 601,
      "underst": 602,
      "أستاذ": 603,
      "تعليمية": 604,
      "ificial": 605,
      "Firebase": 606,
      "FastAPI": 607,
      "Hussein": 608,
      "Term": 609,
      "lligence": 610,
      "ybersecur": 611,
      "بشكل": 612,
      "بناء": 613,
      "نماذج": 614,
      "education": 615,
      "asketball": 616,
      "ybersecurity": 617,
      "CS": 618,
      "Chess": 619,
      "Kal": 620,
      "back": 621,
      "ep": 622,
      "ivers": 623,
      "ne": 624,
      "nivers": 625,
      "who": 626,
      "سك": 627,
      "قع": 628,
      "قن": 629,
      "كي": 630,
      "محتر": 631,
      "مشر": 632,
      "ند": 633,
      "وب": 634,
      "وع": 635,
      "وم": 636,
      "ون": 637,
      "وات": 638,
      "يق": 639,
      "الت": 640,
      "السي": 641,
      "الآلي": 642,
      "ine": 643,
      "orts": 644,
      "ics": 645,
      "اسمه": 646,
      "erience": 647,
      "بيانا": 648,
      "والذكاء": 649,
      "named": 650,
      "ولو": 651,
      "mobile": 652,
      "works": 653,
      "رياضة": 654,
      "بدأ": 655,
      "experience": 656,
      "ساعد": 657,
      "ript": 658,
      "profes": 659,
      "models": 660,
      "understand": 661,
      "Termux": 662,
      "Kali": 663,
      "backend": 664,
      "niversity": 665,
      "محترف": 666,
      "مشروع": 667,
      "بيانات": 668,
      "Code": 669,
      "SCode": 670,
      "VSCode": 671,
      "le": 672,
      "lp": 673,
      "mb": 674,
      "man": 675,
      "sit": 676,
      "ugh": 677,
      "va": 678,
      "أي": 679,
      "اني": 680,
      "بتم": 681,
      "در": 682,
      "سبتم": 683,
      "فض": 684,
      "قب": 685,
      "موا": 686,
      "وف": 687,
      "الذ": 688,
      "الإعلام": 689,
      "الرياضة": 690,
      "help": 691,
      "ont": 692,
      "Java": 693,
      "براني": 694,
      "our": 695,
      "log": 696,
      "ستر": 697,
      "اتي": 698,
      "lay": 699,
      "عمر": 700,
      "امل": 701,
      "والدي": 702,
      "artificial": 703,
      "well": 704,
      "مهند": 705,
      "الأمن": 706,
      "أدوات": 707,
      "websit": 708,
      "app": 709,
      "irst": 710,
      "known": 711,
      "sional": 712,
      "بايل": 713,
      "intelligence": 714,
      "teacher": 715,
      "educational": 716,
      "السيبراني": 717,
      "professional": 718,
      "سبتمبر": 719,
      "مواقع": 720,
      "Basketball": 721,
      "Ho": 722,
      "Sep": 723,
      "University": 724,
      "Yes": 725,
      "creat": 726,
      "cybersecurity": 727,
      "est": 728,
      "first": 729,
      "hno": 730,
      "jour": 731,
      "kil": 732,
      "ld": 733,
      "lf": 734,
      "play": 735,
      "sm": 736,
      "skil": 737,
      "tec": 738,
      "أول": 739,
      "اب": 740,
      "تعرف": 741,
      "جيا": 742,
      "جامعة": 743,
      "دة": 744,
      "دت": 745,
      "رح": 746,
      "طلا": 747,
      "طمو": 748,
      "ظم": 749,
      "مست": 750,
      "هتم": 751,
      "وأنا": 752,
      "يم": 753,
      "يبني": 754,
      "الخ": 755,
      "inter": 756,
      "hemat": 757,
      "anal": 758,
      "aster": 759,
      "علوم": 760,
      "ous": 761,
      "مجال": 762,
      "ite": 763,
      "عمري": 764,
      "اسم": 765,
      "بين": 766,
      "team": 767,
      "temb": 768,
      "ماستر": 769,
      "المفض": 770,
      "ولدت": 771,
      "كنولو": 772,
      "أتقن": 773,
      "عروف": 774,
      "مشاريعي": 775,
      "self": 776,
      "sports": 777,
      "أدر": 778,
      "APIs": 779,
      "learned": 780,
      "أنت": 781,
      "students": 782,
      "mathemat": 783,
      "أسكن": 784,
      "انت": 785,
      "specializing": 786,
      "tools": 787,
      "ney": 788,
      "التكنولو": 789,
      "الذي": 790,
      "logy": 791,
      "مهندس": 792,
      "websites": 793,
      "Septemb": 794,
      "hnology": 795,
      "journey": 796,
      "technology": 797,
      "طلاب": 798,
      "طموح": 799,
      "analy": 800,
      "mathematics": 801,
      "التكنولوجيا": 802,
      "September": 803,
      "Ar": 804,
      "HT": 805,
      "Hu": 806,
      "It": 807,
      "ML": 808,
      "Master": 809,
      "bo": 810,
      "com": 811,
      "cur": 812,
      "cont": 813,
      "ems": 814,
      "fr": 815,
      "ive": 816,
      "ient": 817,
      "ious": 818,
      "jor": 819,
      "od": 820,
      "ra": 821,
      "rent": 822,
      "so": 823,
      "sy": 824,
      "vor": 825,
      "ving": 826,
      "اي": 827,
      "بـ": 828,
      "بالجزائر": 829,
      "تد": 830,
      "ته": 831,
      "تو": 832,
      "جه": 833,
      "حي": 834,
      "حال": 835,
      "داً": 836,
      "ساس": 837,
      "سكن": 838,
      "شغ": 839,
      "شم": 840,
      "شخص": 841,
      "عب": 842,
      "كال": 843,
      "لك": 844,
      "لبناء": 845,
      "نوب": 846,
      "وتطوير": 847,
      "يد": 848,
      "يطور": 849,
      "الص": 850,
      "البيانات": 851,
      "ary": 852,
      "into": 853,
      "فريق": 854,
      "ame": 855,
      "rough": 856,
      "وريا": 857,
      "فية": 858,
      "ate": 859,
      "ريب": 860,
      "ريبت": 861,
      "str": 862,
      "stems": 863,
      "ication": 864,
      "develops": 865,
      "عيش": 866,
      "والد": 867,
      "ذكية": 868,
      "المطور": 869,
      "وار": 870,
      "most": 871,
      "مرح": 872,
      "عدة": 873,
      "project": 874,
      "لاعب": 875,
      "Script": 876,
      "الأساس": 877,
      "thern": 878,
      "favor": 879,
      "learning": 880,
      "تخصصي": 881,
      "البكال": 882,
      "loves": 883,
      "GitHu": 884,
      "تحلي": 885,
      "Inform": 886,
      "main": 887,
      "خبرة": 888,
      "data": 889,
      "تعلمتها": 890,
      "CSS": 891,
      "سكريبت": 892,
      "كيف": 893,
      "أين": 894,
      "JavaScript": 895,
      "apps": 896,
      "How": 897,
      "ested": 898,
      "smart": 899,
      "ابن": 900,
      "ظمة": 901,
      "HTML": 902,
      "both": 903,
      "current": 904,
      "systems": 905,
      "تدريب": 906,
      "favorite": 907,
      "البكالوريا": 908,
      "GitHub": 909,
      "سكريبتات": 910,
      ").": 911,
      "Are": 912,
      "Bac": 913,
      "Cybersecurity": 914,
      "His": 915,
      "Learn": 916,
      "Mach": 917,
      "St": 918,
      "Te": 919,
      "au": 920,
      "abu": 921,
      "bi": 922,
      "bit": 923,
      "basketball": 924,
      "can": 925,
      "cod": 926,
      "cabu": 927,
      "fu": 928,
      "gor": 929,
      "id": 930,
      "iq": 931,
      "ied": 932,
      "igh": 933,
      "lary": 934,
      "ocabu": 935,
      "pas": 936,
      "part": 937,
      "pers": 938,
      "son": 939,
      "sou": 940,
      "sof": 941,
      "sur": 942,
      "ta": 943,
      "tw": 944,
      "tur": 945,
      "tra": 946,
      "ue": 947,
      "ure": 948,
      "vocabu": 949,
      "أبر": 950,
      "أفهم": 951,
      "اري": 952,
      "اية": 953,
      "بجعفر": 954,
      "بورقلة": 955,
      "بعد": 956,
      "بالذكاء": 957,
      "تع": 958,
      "تك": 959,
      "تشم": 960,
      "ثة": 961,
      "ثم": 962,
      "ثون": 963,
      "جداً": 964,
      "خل": 965,
      "دات": 966,
      "زمي": 967,
      "شأت": 968,
      "صا": 969,
      "صلت": 970,
      "غي": 971,
      "فا": 972,
      "قو": 973,
      "كون": 974,
      "كانت": 975,
      "مفر": 976,
      "مدي": 977,
      "معلوم": 978,
      "معروف": 979,
      "نمو": 980,
      "ومبرمج": 981,
      "ومنصة": 982,
      "وتطبيقات": 983,
      "وبايل": 984,
      "ير": 985,
      "يستخدم": 986,
      "يحب": 987,
      "الح": 988,
      "العمل": 989,
      "العر": 990,
      "التعلم": 991,
      "التح": 992,
      "ere": 993,
      "ert": 994,
      "ines": 995,
      "one": 996,
      "ong": 997,
      "ambit": 998,
      "that": 999,
      "through": 1000,
      "after": 1001,
      "ved": 1002,
      "atiq": 1003,
      "eng": 1004,
      "profic": 1005,
      "algor": 1006,
      "ستمر": 1007,
      "برمجيات": 1008,
      "ical": 1009,
      "then": 1010,
      "جزء": 1011,
      "developing": 1012,
      "used": 1013,
      "uses": 1014,
      "ily": 1015,
      "ميلا": 1016,
      "بية": 1017,
      "بير": 1018,
      "Where": 1019,
      "والبرمجة": 1020,
      "الموبايل": 1021,
      "built": 1022,
      "متعد": 1023,
      "لغتي": 1024,
      "plication": 1025,
      "مهار": 1026,
      "الجامعة": 1027,
      "الجنوب": 1028,
      "sever": 1029,
      "studied": 1030,
      "للمفر": 1031,
      "ياً": 1032,
      "موبايل": 1033,
      "asets": 1034,
      "application": 1035,
      "ithms": 1036,
      "scrip": 1037,
      "script": 1038,
      "expert": 1039,
      "very": 1040,
      "major": 1041,
      "خبرني": 1042,
      "نفس": 1043,
      "نفسك": 1044,
      "بايثون": 1045,
      "datasets": 1046,
      "الكامل": 1047,
      "notab": 1048,
      "درس": 1049,
      "قبل": 1050,
      "helped": 1051,
      "عمره": 1052,
      "created": 1053,
      "played": 1054,
      "skills": 1055,
      "يمكن": 1056,
      "interested": 1057,
      "اسمك": 1058,
      "المفضلة": 1059,
      "أدرس": 1060,
      "comb": 1061,
      "حالياً": 1062,
      "شخصي": 1063,
      "الصفر": 1064,
      "وارزمي": 1065,
      "تحليل": 1066,
      "Informatiq": 1067,
      "currently": 1068,
      "Learning": 1069,
      "Machine": 1070,
      "coding": 1071,
      "full": 1072,
      "passion": 1073,
      "softw": 1074,
      "surname": 1075,
      "vocabulary": 1076,
      "أبرز": 1077,
      "تشمل": 1078,
      "خلال": 1079,
      "معلومات": 1080,
      "نموذج": 1081,
      "العربية": 1082,
      "ambitious": 1083,
      "proficient": 1084,
      "algorithms": 1085,
      "ميلادي": 1086,
      "متعددة": 1087,
      "several": 1088,
      "للمفردات": 1089,
      "applications": 1090,
      "scripts": 1091,
      "scripting": 1092,
      "وارزميات": 1093,
      "Informatique": 1094,
      "software": 1095,
      "09": 1096,
      "11": 1097,
      "26": 1098,
      "And": 1099,
      "Do": 1100,
      "EN": 1101,
      "Fa": 1102,
      "Language": 1103,
      "Ma": 1104,
      "Pro": 1105,
      "Sp": 1106,
      "UI": 1107,
      "Whe": 1108,
      "ay": 1109,
      "aving": 1110,
      "by": 1111,
      "bas": 1112,
      "bir": 1113,
      "cl": 1114,
      "cou": 1115,
      "cal": 1116,
      "city": 1117,
      "call": 1118,
      "code": 1119,
      "du": 1120,
      "der": 1121,
      "eve": 1122,
      "eld": 1123,
      "fi": 1124,
      "fam": 1125,
      "fut": 1126,
      "go": 1127,
      "gan": 1128,
      "gave": 1129,
      "hic": 1130,
      "him": 1131,
      "hack": 1132,
      "high": 1133,
      "ipl": 1134,
      "ke": 1135,
      "llo": 1136,
      "led": 1137,
      "larg": 1138,
      "op": 1139,
      "rat": 1140,
      "sis": 1141,
      "sor": 1142,
      "sol": 1143,
      "ten": 1144,
      "tificial": 1145,
      "up": 1146,
      "university": 1147,
      "vir": 1148,
      "wn": 1149,
      "أح": 1150,
      "أع": 1151,
      "أهتم": 1152,
      "أعيش": 1153,
      "أخبرني": 1154,
      "ؤمن": 1155,
      "إط": 1156,
      "ئة": 1157,
      "ئي": 1158,
      "اة": 1159,
      "افي": 1160,
      "استخدم": 1161,
      "احتر": 1162,
      "ادة": 1163,
      "اهتم": 1164,
      "بة": 1165,
      "بجامعة": 1166,
      "تخد": 1167,
      "تني": 1168,
      "تعمل": 1169,
      "تقن": 1170,
      "تسكن": 1171,
      "تاري": 1172,
      "تغي": 1173,
      "جر": 1174,
      "جمع": 1175,
      "حر": 1176,
      "خر": 1177,
      "خلت": 1178,
      "خبير": 1179,
      "خوارزميات": 1180,
      "دخلت": 1181,
      "ذلك": 1182,
      "رئي": 1183,
      "سط": 1184,
      "طني": 1185,
      "عائ": 1186,
      "عام": 1187,
      "عالم": 1188,
      "عبت": 1189,
      "عامل": 1190,
      "فة": 1191,
      "فار": 1192,
      "قت": 1193,
      "قل": 1194,
      "قي": 1195,
      "قري": 1196,
      "قبي": 1197,
      "قيم": 1198,
      "كة": 1199,
      "كت": 1200,
      "كث": 1201,
      "كم": 1202,
      "لم": 1203,
      "لتطوير": 1204,
      "لتي": 1205,
      "لقب": 1206,
      "لعبت": 1207,
      "لقبي": 1208,
      "مث": 1209,
      "موال": 1210,
      "مولو": 1211,
      "نى": 1212,
      "نظمة": 1213,
      "همت": 1214,
      "ود": 1215,
      "ومن": 1216,
      "ومي": 1217,
      "وDjango": 1218,
      "وتخصص": 1219,
      "وFlask": 1220,
      "وأتعلم": 1221,
      "ين": 1222,
      "يفهم": 1223,
      "يسكن": 1224,
      "يكون": 1225,
      "يؤمن": 1226,
      "يتقن": 1227,
      "يجمع": 1228,
      "يومي": 1229,
      "العل": 1230,
      "الوا": 1231,
      "التعلي": 1232,
      "الرياضيات": 1233,
      "السلة": 1234,
      "النماذج": 1235,
      "الطلاب": 1236,
      "الرئي": 1237,
      "ink": 1238,
      "inal": 1239,
      "incl": 1240,
      "onge": 1241,
      "onment": 1242,
      "جعفار": 1243,
      "among": 1244,
      "think": 1245,
      "roid": 1246,
      "envir": 1247,
      "des": 1248,
      "deep": 1249,
      "edit": 1250,
      "اته": 1251,
      "برمجية": 1252,
      "grap": 1253,
      "ition": 1254,
      "عميق": 1255,
      "اسيات": 1256,
      "اسوب": 1257,
      "باً": 1258,
      "باستمر": 1259,
      "ange": 1260,
      "بيرة": 1261,
      "بيئة": 1262,
      "telligence": 1263,
      "وية": 1264,
      "act": 1265,
      "ache": 1266,
      "but": 1267,
      "المه": 1268,
      "المستخدم": 1269,
      "المشاري": 1270,
      "المعروف": 1271,
      "living": 1272,
      "lieve": 1273,
      "like": 1274,
      "ليس": 1275,
      "abic": 1276,
      "متى": 1277,
      "متخصص": 1278,
      "ولاية": 1279,
      "moved": 1280,
      "builds": 1281,
      "Hello": 1282,
      "كنت": 1283,
      "لغوية": 1284,
      "working": 1285,
      "أتعامل": 1286,
      "مهتم": 1287,
      "أستخدمه": 1288,
      "تمد": 1289,
      "الأنظمة": 1290,
      "study": 1291,
      "أدمج": 1292,
      "أداة": 1293,
      "للمشاريع": 1294,
      "منصات": 1295,
      "did": 1296,
      "ribut": 1297,
      "yourself": 1298,
      "how": 1299,
      "hool": 1300,
      "أنظمة": 1301,
      "أنشأت": 1302,
      "scrat": 1303,
      "school": 1304,
      "أساسيات": 1305,
      "Intelligence": 1306,
      "began": 1307,
      "believe": 1308,
      "does": 1309,
      "math": 1310,
      "خبرتي": 1311,
      "لته": 1312,
      "نفسي": 1313,
      "specialization": 1314,
      "change": 1315,
      "الكبيرة": 1316,
      "integr": 1317,
      "lives": 1318,
      "reate": 1319,
      "كيفية": 1320,
      "ineer": 1321,
      "ساعدني": 1322,
      "understands": 1323,
      "many": 1324,
      "ught": 1325,
      "درست": 1326,
      "ontend": 1327,
      "creator": 1328,
      "رحلتي": 1329,
      "رحلته": 1330,
      "مستقبل": 1331,
      "الخاص": 1332,
      "المفضل": 1333,
      "أدرب": 1334,
      "analyt": 1335,
      "analysis": 1336,
      "Artificial": 1337,
      "Arabic": 1338,
      "contribut": 1339,
      "frame": 1340,
      "frontend": 1341,
      "جهة": 1342,
      "حيث": 1343,
      "شغفي": 1344,
      "مرحلة": 1345,
      "مرحبا": 1346,
      "الأساسية": 1347,
      "Baccal": 1348,
      "Tell": 1349,
      "aureate": 1350,
      "bio": 1351,
      "person": 1352,
      "southern": 1353,
      "taught": 1354,
      "train": 1355,
      "تعتمد": 1356,
      "صاحب": 1357,
      "قوى": 1358,
      "مدينة": 1359,
      "الحاسوب": 1360,
      "engineer": 1361,
      "notably": 1362,
      "combines": 1363,
      "شخصيتي": 1364,
      "أبرزها": 1365,
      "Android": 1366,
      "Father": 1367,
      "Sports": 1368,
      "When": 1369,
      "birth": 1370,
      "could": 1371,
      "field": 1372,
      "family": 1373,
      "future": 1374,
      "hacking": 1375,
      "large": 1376,
      "إطار": 1377,
      "اهتمام": 1378,
      "تخدم": 1379,
      "تاريخ": 1380,
      "تغيير": 1381,
      "حرر": 1382,
      "خرج": 1383,
      "سطة": 1384,
      "قريباً": 1385,
      "مواليد": 1386,
      "مولود": 1387,
      "الواجهة": 1388,
      "التعليم": 1389,
      "الرئيسي": 1390,
      "ongest": 1391,
      "environment": 1392,
      "editor": 1393,
      "باستمرار": 1394,
      "المشاريع": 1395,
      "scratch": 1396,
      "believes": 1397,
      "مستقبله": 1398,
      "framework": 1399,
      "Baccalaureate": 1400,
      "Ab": 1401,
      "Age": 1402,
      "Amb": 1403,
      "Be": 1404,
      "Bu": 1405,
      "Born": 1406,
      "City": 1407,
      "Creat": 1408,
      "De": 1409,
      "Dat": 1410,
      "Det": 1411,
      "DEN": 1412,
      "ED": 1413,
      "Every": 1414,
      "FO": 1415,
      "Flo": 1416,
      "From": 1417,
      "First": 1418,
      "GL": 1419,
      "Give": 1420,
      "IS": 1421,
      "IT": 1422,
      "IX": 1423,
      "IDEN": 1424,
      "Know": 1425,
      "LO": 1426,
      "Lo": 1427,
      "Lite": 1428,
      "Mo": 1429,
      "MIX": 1430,
      "NG": 1431,
      "Name": 1432,
      "Pl": 1433,
      "Play": 1434,
      "QLite": 1435,
      "RM": 1436,
      "RES": 1437,
      "Sou": 1438,
      "Sear": 1439,
      "SQLite": 1440,
      "Th": 1441,
      "Tor": 1442,
      "Ten": 1443,
      "TIT": 1444,
      "You": 1445,
      "ath": 1446,
      "ail": 1447,
      "aver": 1448,
      "aily": 1449,
      "adu": 1450,
      "bec": 1451,
      "bal": 1452,
      "ble": 1453,
      "bbi": 1454,
      "bta": 1455,
      "bby": 1456,
      "car": 1457,
      "con": 1458,
      "cro": 1459,
      "ces": 1460,
      "care": 1461,
      "comp": 1462,
      "cipl": 1463,
      "dis": 1464,
      "dle": 1465,
      "day": 1466,
      "dition": 1467,
      "daily": 1468,
      "ew": 1469,
      "eth": 1470,
      "ete": 1471,
      "eto": 1472,
      "epl": 1473,
      "ever": 1474,
      "fe": 1475,
      "fou": 1476,
      "fund": 1477,
      "fast": 1478,
      "gi": 1479,
      "gn": 1480,
      "gam": 1481,
      "gen": 1482,
      "git": 1483,
      "gac": 1484,
      "give": 1485,
      "hy": 1486,
      "har": 1487,
      "hor": 1488,
      "hat": 1489,
      "has": 1490,
      "hom": 1491,
      "hase": 1492,
      "hund": 1493,
      "having": 1494,
      "ide": 1495,
      "ign": 1496,
      "lt": 1497,
      "lat": 1498,
      "last": 1499,
      "mm": 1500,
      "mu": 1501,
      "mor": 1502,
      "mach": 1503,
      "master": 1504,
      "mid": 1505,
      "minal": 1506,
      "nor": 1507,
      "ned": 1508,
      "ntur": 1509,
      "ower": 1510,
      "ood": 1511,
      "own": 1512,
      "obta": 1513,
      "pr": 1514,
      "pts": 1515,
      "pre": 1516,
      "pecial": 1517,
      "pend": 1518,
      "phase": 1519,
      "power": 1520,
      "red": 1521,
      "rit": 1522,
      "rongest": 1523,
      "su": 1524,
      "suc": 1525,
      "sive": 1526,
      "same": 1527,
      "saving": 1528,
      "shar": 1529,
      "ty": 1530,
      "tro": 1531,
      "targ": 1532,
      "tent": 1533,
      "twe": 1534,
      "tication": 1535,
      "ture": 1536,
      "uous": 1537,
      "udes": 1538,
      "vin": 1539,
      "vious": 1540,
      "wan": 1541,
      "wil": 1542,
      "went": 1543,
      "way": 1544,
      "whic": 1545,
      "what": 1546,
      "wide": 1547,
      "writ": 1548,
      "yon": 1549,
      "ze": 1550,
      "آن": 1551,
      "آفا": 1552,
      "أص": 1553,
      "أغ": 1554,
      "أف": 1555,
      "أبي": 1556,
      "أسي": 1557,
      "أوا": 1558,
      "أعرف": 1559,
      "أفض": 1560,
      "أكون": 1561,
      "أكت": 1562,
      "أقوى": 1563,
      "إد": 1564,
      "إذ": 1565,
      "إر": 1566,
      "إض": 1567,
      "إن": 1568,
      "ئات": 1569,
      "اخ": 1570,
      "اد": 1571,
      "اق": 1572,
      "ابر": 1573,
      "ايات": 1574,
      "ارة": 1575,
      "اكل": 1576,
      "استخدام": 1577,
      "استر": 1578,
      "احي": 1579,
      "افية": 1580,
      "اعدة": 1581,
      "اخبرني": 1582,
      "افة": 1583,
      "بح": 1584,
      "بخ": 1585,
      "بل": 1586,
      "بم": 1587,
      "به": 1588,
      "بما": 1589,
      "بلغ": 1590,
      "بلا": 1591,
      "بأن": 1592,
      "بالشطرنج": 1593,
      "بلدي": 1594,
      "بالتكنولوجيا": 1595,
      "بقو": 1596,
      "بالجامعة": 1597,
      "بنفس": 1598,
      "بنفسك": 1599,
      "بتحليل": 1600,
      "بنى": 1601,
      "بمرحلة": 1602,
      "تص": 1603,
      "تف": 1604,
      "تق": 1605,
      "تى": 1606,
      "تست": 1607,
      "تطور": 1608,
      "تحب": 1609,
      "تحسين": 1610,
      "تساعد": 1611,
      "تعيش": 1612,
      "تفا": 1613,
      "تدرس": 1614,
      "ثال": 1615,
      "جن": 1616,
      "جام": 1617,
      "جيات": 1618,
      "جان": 1619,
      "جنوب": 1620,
      "جيد": 1621,
      "حث": 1622,
      "حد": 1623,
      "حص": 1624,
      "حف": 1625,
      "حق": 1626,
      "حل": 1627,
      "حدي": 1628,
      "حوال": 1629,
      "حيات": 1630,
      "حيا": 1631,
      "حالك": 1632,
      "حصلت": 1633,
      "حتى": 1634,
      "خاص": 1635,
      "خلا": 1636,
      "خاد": 1637,
      "ختص": 1638,
      "دف": 1639,
      "دق": 1640,
      "ده": 1641,
      "دائ": 1642,
      "داتي": 1643,
      "ذة": 1644,
      "ذت": 1645,
      "ذاتي": 1646,
      "رت": 1647,
      "رق": 1648,
      "رته": 1649,
      "ركة": 1650,
      "رأسي": 1651,
      "زة": 1652,
      "زن": 1653,
      "سع": 1654,
      "سق": 1655,
      "سن": 1656,
      "سري": 1657,
      "سأت": 1658,
      "سلا": 1659,
      "سلم": 1660,
      "سأكون": 1661,
      "شئ": 1662,
      "شري": 1663,
      "شبا": 1664,
      "صل": 1665,
      "صم": 1666,
      "صان": 1667,
      "ضبا": 1668,
      "ضاً": 1669,
      "طو": 1670,
      "طي": 1671,
      "طتني": 1672,
      "طقي": 1673,
      "عت": 1674,
      "عى": 1675,
      "عتي": 1676,
      "عاي": 1677,
      "عادة": 1678,
      "عشري": 1679,
      "فتح": 1680,
      "فكي": 1681,
      "فهمت": 1682,
      "قف": 1683,
      "قوا": 1684,
      "قلت": 1685,
      "قاعدة": 1686,
      "كر": 1687,
      "كام": 1688,
      "كما": 1689,
      "كان": 1690,
      "كامل": 1691,
      "كود": 1692,
      "لب": 1693,
      "لف": 1694,
      "لجعفر": 1695,
      "لدر": 1696,
      "لفية": 1697,
      "لإد": 1698,
      "لحف": 1699,
      "مد": 1700,
      "منا": 1701,
      "مبا": 1702,
      "مسي": 1703,
      "مكن": 1704,
      "محب": 1705,
      "معرف": 1706,
      "مساعد": 1707,
      "مصا": 1708,
      "مفا": 1709,
      "مقيم": 1710,
      "مكث": 1711,
      "محرر": 1712,
      "مئات": 1713,
      "مسق": 1714,
      "مصم": 1715,
      "مطو": 1716,
      "ملف": 1717,
      "نو": 1718,
      "نتي": 1719,
      "نظم": 1720,
      "نشأت": 1721,
      "هنا": 1722,
      "هات": 1723,
      "هذا": 1724,
      "هدف": 1725,
      "وو": 1726,
      "وى": 1727,
      "وجعفر": 1728,
      "واس": 1729,
      "وعمل": 1730,
      "وذكاء": 1731,
      "وFlutter": 1732,
      "وأت": 1733,
      "ومطور": 1734,
      "وأبني": 1735,
      "وGit": 1736,
      "وأطور": 1737,
      "وأعمل": 1738,
      "وFirebase": 1739,
      "وبناء": 1740,
      "ونماذج": 1741,
      "وTermux": 1742,
      "وbackend": 1743,
      "وولدت": 1744,
      "وأتقن": 1745,
      "وأسكن": 1746,
      "وتخصصي": 1747,
      "وتحلي": 1748,
      "وCSS": 1749,
      "وJavaScript": 1750,
      "وHTML": 1751,
      "وموبايل": 1752,
      "وتحليل": 1753,
      "وقت": 1754,
      "وسطة": 1755,
      "وTen": 1756,
      "وكان": 1757,
      "وهذا": 1758,
      "ينا": 1759,
      "يتعل": 1760,
      "يمت": 1761,
      "يرة": 1762,
      "يتخصص": 1763,
      "يسا": 1764,
      "يعرف": 1765,
      "يبدأ": 1766,
      "يساعد": 1767,
      "يهتم": 1768,
      "يعيش": 1769,
      "يدرس": 1770,
      "يبلغ": 1771,
      "ّر": 1772,
      "ّف": 1773,
      "الـ": 1774,
      "النا": 1775,
      "المن": 1776,
      "المج": 1777,
      "التي": 1778,
      "الذا": 1779,
      "التخصص": 1780,
      "الكل": 1781,
      "الشاب": 1782,
      "الان": 1783,
      "التعليمية": 1784,
      "الماستر": 1785,
      "الحال": 1786,
      "الشغ": 1787,
      "الشم": 1788,
      "الفريق": 1789,
      "الخبرة": 1790,
      "السكريبتات": 1791,
      "البرمجية": 1792,
      "اللغوية": 1793,
      "المنصات": 1794,
      "الإر": 1795,
      "الاخ": 1796,
      "الثال": 1797,
      "الشبا": 1798,
      "الهات": 1799,
      "الوقت": 1800,
      "erat": 1801,
      "eral": 1802,
      "arch": 1803,
      "ining": 1804,
      "inde": 1805,
      "inform": 1806,
      "insp": 1807,
      "inuous": 1808,
      "ons": 1809,
      "any": 1810,
      "ande": 1811,
      "ance": 1812,
      "ament": 1813,
      "this": 1814,
      "ism": 1815,
      "ised": 1816,
      "istent": 1817,
      "rol": 1818,
      "roll": 1819,
      "منة": 1820,
      "مني": 1821,
      "منشئ": 1822,
      "فيه": 1823,
      "فيها": 1824,
      "فيفة": 1825,
      "فيمكن": 1826,
      "ecture": 1827,
      "PyTor": 1828,
      "vel": 1829,
      "vement": 1830,
      "ventur": 1831,
      "ates": 1832,
      "ened": 1833,
      "enter": 1834,
      "enroll": 1835,
      "ريف": 1836,
      "ريات": 1837,
      "عله": 1838,
      "علمت": 1839,
      "علية": 1840,
      "proble": 1841,
      "provin": 1842,
      "provement": 1843,
      "als": 1844,
      "ality": 1845,
      "also": 1846,
      "alway": 1847,
      "deepl": 1848,
      "ستاذ": 1849,
      "شهادة": 1850,
      "ورقلي": 1851,
      "اتك": 1852,
      "اتية": 1853,
      "اتذة": 1854,
      "stri": 1855,
      "ice": 1856,
      "them": 1857,
      "gradu": 1858,
      "grew": 1859,
      "جزاي": 1860,
      "itecture": 1861,
      "veloper": 1862,
      "عمق": 1863,
      "developed": 1864,
      "terested": 1865,
      "terminal": 1866,
      "اسة": 1867,
      "هوية": 1868,
      "هواية": 1869,
      "هوايات": 1870,
      "grammer": 1871,
      "ilder": 1872,
      "نياته": 1873,
      "ديد": 1874,
      "ديف": 1875,
      "ديات": 1876,
      "ديني": 1877,
      "ديداً": 1878,
      "باختص": 1879,
      "fore": 1880,
      "عيد": 1881,
      "especial": 1882,
      "شاكل": 1883,
      "شاركة": 1884,
      "تعلمني": 1885,
      "cepts": 1886,
      "ions": 1887,
      "teache": 1888,
      "ماً": 1889,
      "ماعي": 1890,
      "ماذا": 1891,
      "ويطور": 1892,
      "ويحب": 1893,
      "والشطرنج": 1894,
      "والإعلام": 1895,
      "والرياضة": 1896,
      "والاحتر": 1897,
      "والخوارزميات": 1898,
      "والخاد": 1899,
      "والعشري": 1900,
      "والمصا": 1901,
      "المتخصص": 1902,
      "المرح": 1903,
      "المتو": 1904,
      "المستمر": 1905,
      "المحرر": 1906,
      "المشاكل": 1907,
      "عملت": 1908,
      "عمله": 1909,
      "عملي": 1910,
      "سيتك": 1911,
      "arted": 1912,
      "lid": 1913,
      "ligh": 1914,
      "life": 1915,
      "rely": 1916,
      "reache": 1917,
      "لية": 1918,
      "developers": 1919,
      "utions": 1920,
      "واحد": 1921,
      "weap": 1922,
      "متوار": 1923,
      "متخرج": 1924,
      "متنو": 1925,
      "متوسطة": 1926,
      "ولا": 1927,
      "وله": 1928,
      "ولاي": 1929,
      "programmers": 1930,
      "moder": 1931,
      "world": 1932,
      "بنية": 1933,
      "بنيت": 1934,
      "نجاحي": 1935,
      "builder": 1936,
      "لغته": 1937,
      "لغتك": 1938,
      "worked": 1939,
      "2025": 1940,
      "jects": 1941,
      "مررت": 1942,
      "عدل": 1943,
      "عرعت": 1944,
      "عرّف": 1945,
      "oming": 1946,
      "plete": 1947,
      "uding": 1948,
      "udent": 1949,
      "عندي": 1950,
      "الجديد": 1951,
      "الجماعي": 1952,
      "رياضي": 1953,
      "بداي": 1954,
      "تمع": 1955,
      "هيم": 1956,
      "هياكل": 1957,
      "الأجه": 1958,
      "الأقوى": 1959,
      "الأخلا": 1960,
      "الأستاذ": 1961,
      "there": 1962,
      "improvement": 1963,
      "لله": 1964,
      "للشطرنج": 1965,
      "للبيانات": 1966,
      "للطلاب": 1967,
      "للتدريب": 1968,
      "للموبايل": 1969,
      "للتغيير": 1970,
      "للتحسين": 1971,
      "للمتوسطة": 1972,
      "agement": 1973,
      "memor": 1974,
      "dived": 1975,
      "digit": 1976,
      "ndation": 1977,
      "موقع": 1978,
      "موطني": 1979,
      "acher": 1980,
      "مشاريعك": 1981,
      "مشاريعه": 1982,
      "exten": 1983,
      "hobby": 1984,
      "تخصصك": 1985,
      "تخصصاتي": 1986,
      "alleng": 1987,
      "ired": 1988,
      "ization": 1989,
      "izons": 1990,
      "scient": 1991,
      "serve": 1992,
      "were": 1993,
      "ألهم": 1994,
      "تراق": 1995,
      "ترعرعت": 1996,
      "الجزائريين": 1997,
      "platforms": 1998,
      "expande": 1999,
      "eting": 2000,
      "uctur": 2001,
      "أسهمت": 2002,
      "أسعى": 2003,
      "أساتذة": 2004,
      "أستسلم": 2005,
      "أستطي": 2006,
      "تحصلت": 2007,
      "تحديداً": 2008,
      "ساً": 2009,
      "ساكن": 2010,
      "specialty": 2011,
      "Intro": 2012,
      "Interested": 2013,
      "best": 2014,
      "before": 2015,
      "doing": 2016,
      "لتنا": 2017,
      "نفذت": 2018,
      "عرفني": 2019,
      "specialized": 2020,
      "specializes": 2021,
      "challeng": 2022,
      "date": 2023,
      "version": 2024,
      "بتجر": 2025,
      "شركة": 2026,
      "الكبير": 2027,
      "الكود": 2028,
      "المبرمجون": 2029,
      "profile": 2030,
      "teachers": 2031,
      "model": 2032,
      "understood": 2033,
      "Terminal": 2034,
      "new": 2035,
      "never": 2036,
      "ندس": 2037,
      "وبنى": 2038,
      "ومقيم": 2039,
      "ومشاركة": 2040,
      "يقية": 2041,
      "التفكي": 2042,
      "التعمق": 2043,
      "السيرة": 2044,
      "ساعدته": 2045,
      "ساعدتني": 2046,
      "professor": 2047,
      "understanding": 2048,
      "محترفاً": 2049,
      "مشروعك": 2050,
      "lete": 2051,
      "legac": 2052,
      "level": 2053,
      "management": 2054,
      "أيضاً": 2055,
      "قبلي": 2056,
      "الذاتية": 2057,
      "helps": 2058,
      "logical": 2059,
      "اتيجيات": 2060,
      "عمرك": 2061,
      "مهندساً": 2062,
      "website": 2063,
      "professionalism": 2064,
      "Hobbi": 2065,
      "player": 2066,
      "small": 2067,
      "skill": 2068,
      "skilled": 2069,
      "ابحث": 2070,
      "مستقل": 2071,
      "مستوى": 2072,
      "مستقبلي": 2073,
      "الخوارزميات": 2074,
      "الخلفية": 2075,
      "الخفيفة": 2076,
      "interest": 2077,
      "interact": 2078,
      "بينهم": 2079,
      "teamwork": 2080,
      "أتقنت": 2081,
      "انتقل": 2082,
      "انتقلت": 2083,
      "طموحة": 2084,
      "analyze": 2085,
      "complete": 2086,
      "continuous": 2087,
      "control": 2088,
      "raised": 2089,
      "soon": 2090,
      "solid": 2091,
      "بـC": 2092,
      "توجه": 2093,
      "توسع": 2094,
      "توقف": 2095,
      "شغوف": 2096,
      "يدمج": 2097,
      "الصغي": 2098,
      "ategi": 2099,
      "strong": 2100,
      "strongest": 2101,
      "structur": 2102,
      "strategi": 2103,
      "والدك": 2104,
      "والده": 2105,
      "المطورين": 2106,
      "الأساسي": 2107,
      "Information": 2108,
      "Strongest": 2109,
      "Started": 2110,
      "Student": 2111,
      "Teacher": 2112,
      "authen": 2113,
      "ight": 2114,
      "persistent": 2115,
      "south": 2116,
      "turned": 2117,
      "tradition": 2118,
      "اريد": 2119,
      "تعريف": 2120,
      "مدينتي": 2121,
      "الحمد": 2122,
      "التحق": 2123,
      "التحقت": 2124,
      "التحديات": 2125,
      "مهاراتي": 2126,
      "مهاراته": 2127,
      "مهاراتك": 2128,
      "majored": 2129,
      "نفسه": 2130,
      "notable": 2131,
      "يمكنك": 2132,
      "يمكنني": 2133,
      "combine": 2134,
      "passionate": 2135,
      "خلاله": 2136,
      "نموذجي": 2137,
      "ENGL": 2138,
      "Math": 2139,
      "Major": 2140,
      "Programmer": 2141,
      "Projects": 2142,
      "based": 2143,
      "basics": 2144,
      "calls": 2145,
      "duce": 2146,
      "got": 2147,
      "himself": 2148,
      "highly": 2149,
      "iple": 2150,
      "ledge": 2151,
      "operat": 2152,
      "opened": 2153,
      "sorFlo": 2154,
      "solve": 2155,
      "solutions": 2156,
      "أحل": 2157,
      "أحلل": 2158,
      "أعطني": 2159,
      "أعطتني": 2160,
      "افيك": 2161,
      "استخدمت": 2162,
      "احترافي": 2163,
      "جرافيك": 2164,
      "عائلة": 2165,
      "عائلتنا": 2166,
      "كتبت": 2167,
      "كثيرة": 2168,
      "لقبك": 2169,
      "لقبه": 2170,
      "مثل": 2171,
      "مثابر": 2172,
      "وتخصصت": 2173,
      "يومياً": 2174,
      "العلم": 2175,
      "العلمي": 2176,
      "includes": 2177,
      "including": 2178,
      "thinking": 2179,
      "design": 2180,
      "graphic": 2181,
      "graphy": 2182,
      "actice": 2183,
      "المهني": 2184,
      "المهندس": 2185,
      "integrate": 2186,
      "integrates": 2187,
      "analytics": 2188,
      "analytical": 2189,
      "contributed": 2190,
      "contributes": 2191,
      "biography": 2192,
      "personality": 2193,
      "birthday": 2194,
      "اهتمامه": 2195,
      "اهتماماتي": 2196,
      "About": 2197,
      "Ambition": 2198,
      "Beyon": 2199,
      "Builder": 2200,
      "Creator": 2201,
      "Developer": 2202,
      "Data": 2203,
      "Detail": 2204,
      "Everyone": 2205,
      "FORM": 2206,
      "ISH": 2207,
      "IDENTIT": 2208,
      "Knowledge": 2209,
      "LONG": 2210,
      "Lover": 2211,
      "Mobile": 2212,
      "MIXED": 2213,
      "Platform": 2214,
      "Player": 2215,
      "REST": 2216,
      "Southern": 2217,
      "Search": 2218,
      "Through": 2219,
      "athlete": 2220,
      "average": 2221,
      "becoming": 2222,
      "balance": 2223,
      "cares": 2224,
      "concepts": 2225,
      "cross": 2226,
      "cess": 2227,
      "career": 2228,
      "company": 2229,
      "cipline": 2230,
      "discipline": 2231,
      "ethical": 2232,
      "etown": 2233,
      "foundation": 2234,
      "fundament": 2235,
      "games": 2236,
      "general": 2237,
      "horizons": 2238,
      "hometown": 2239,
      "hundred": 2240,
      "ltiple": 2241,
      "later": 2242,
      "mmary": 2243,
      "multiple": 2244,
      "machines": 2245,
      "mastered": 2246,
      "middle": 2247,
      "northern": 2248,
      "obtaining": 2249,
      "practice": 2250,
      "previous": 2251,
      "pendent": 2252,
      "summary": 2253,
      "success": 2254,
      "sively": 2255,
      "sharing": 2256,
      "targeting": 2257,
      "tweight": 2258,
      "want": 2259,
      "will": 2260,
      "which": 2261,
      "written": 2262,
      "آفاق": 2263,
      "أصبح": 2264,
      "أغلب": 2265,
      "أفعله": 2266,
      "أوازن": 2267,
      "أفضل": 2268,
      "أكتب": 2269,
      "إذن": 2270,
      "إضافة": 2271,
      "إنه": 2272,
      "استخدامها": 2273,
      "استراتيجيات": 2274,
      "بخير": 2275,
      "بلده": 2276,
      "بمعدل": 2277,
      "بقوة": 2278,
      "تفكر": 2279,
      "تقنياته": 2280,
      "تستهدف": 2281,
      "تطوره": 2282,
      "تفاعلية": 2283,
      "جنسيتك": 2284,
      "جامعتي": 2285,
      "جانب": 2286,
      "حصوله": 2287,
      "حقيقية": 2288,
      "حلول": 2289,
      "حديثة": 2290,
      "حوالي": 2291,
      "حياتي": 2292,
      "حياة": 2293,
      "خاصة": 2294,
      "دقة": 2295,
      "دائماً": 2296,
      "رقمنة": 2297,
      "سنوات": 2298,
      "سريعة": 2299,
      "سأتخرج": 2300,
      "سلاحي": 2301,
      "صلبة": 2302,
      "صانع": 2303,
      "ضباط": 2304,
      "عايش": 2305,
      "قواعد": 2306,
      "كاملة": 2307,
      "لدراسة": 2308,
      "لإدارة": 2309,
      "لحفظ": 2310,
      "مناداتي": 2311,
      "مباريات": 2312,
      "مسيرته": 2313,
      "معرفة": 2314,
      "مساعدتك": 2315,
      "مفاهيم": 2316,
      "مكثف": 2317,
      "محررى": 2318,
      "مسقط": 2319,
      "مصمم": 2320,
      "مطوّر": 2321,
      "هناك": 2322,
      "ووصلت": 2323,
      "واسعة": 2324,
      "وأتخصص": 2325,
      "وأتقنها": 2326,
      "وتحليلية": 2327,
      "وتحليلات": 2328,
      "وTensorFlo": 2329,
      "يناديني": 2330,
      "يتعلق": 2331,
      "يمتلك": 2332,
      "يساهم": 2333,
      "يعرفه": 2334,
      "الناس": 2335,
      "المنطقي": 2336,
      "المجتمع": 2337,
      "الذاكرة": 2338,
      "الانضباط": 2339,
      "الحالي": 2340,
      "الشغف": 2341,
      "الشمال": 2342,
      "الإرث": 2343,
      "الاختراق": 2344,
      "الثالثة": 2345,
      "الشباب": 2346,
      "الهاتف": 2347,
      "architecture": 2348,
      "independent": 2349,
      "information": 2350,
      "inspired": 2351,
      "PyTorch": 2352,
      "ventured": 2353,
      "entered": 2354,
      "enrolling": 2355,
      "علمتني": 2356,
      "problems": 2357,
      "province": 2358,
      "always": 2359,
      "deeply": 2360,
      "strive": 2361,
      "graduate": 2362,
      "جزايري": 2363,
      "باختصار": 2364,
      "especially": 2365,
      "teaches": 2366,
      "والاحترافية": 2367,
      "والخادم": 2368,
      "والعشرين": 2369,
      "والمصادقة": 2370,
      "المرحلة": 2371,
      "المتوسطة": 2372,
      "lightweight": 2373,
      "reached": 2374,
      "weapon": 2375,
      "متوارثة": 2376,
      "متخرجاً": 2377,
      "متنوعة": 2378,
      "ولايتي": 2379,
      "modern": 2380,
      "بدايته": 2381,
      "الأجهزة": 2382,
      "الأخلاقي": 2383,
      "memory": 2384,
      "digitization": 2385,
      "extensively": 2386,
      "scientific": 2387,
      "expanded": 2388,
      "أستطيع": 2389,
      "Introduce": 2390,
      "challenges": 2391,
      "بتجربة": 2392,
      "التفكير": 2393,
      "legacy": 2394,
      "Hobbies": 2395,
      "interactive": 2396,
      "continuously": 2397,
      "الصغيرة": 2398,
      "structures": 2399,
      "strategies": 2400,
      "authentication": 2401,
      "ENGLISH": 2402,
      "operating": 2403,
      "designer": 2404,
      "Beyond": 2405,
      "Details": 2406,
      "IDENTITY": 2407,
      "fundamentals": 2408,
      "hundreds": 2409,
      "previously": 2410,
