{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          3
        ],
        "tokens": [
          "[EOS]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "!": 4,
      "'": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "?": 23,
      "A": 24,
      "B": 25,
      "C": 26,
      "D": 27,
      "E": 28,
      "F": 29,
      "G": 30,
      "H": 31,
      "I": 32,
      "J": 33,
      "K": 34,
      "L": 35,
      "M": 36,
      "N": 37,
      "O": 38,
      "P": 39,
      "Q": 40,
      "R": 41,
      "S": 42,
      "T": 43,
      "U": 44,
      "V": 45,
      "W": 46,
      "X": 47,
      "Y": 48,
      "Z": 49,
      "[": 50,
      "]": 51,
      "a": 52,
      "b": 53,
      "c": 54,
      "d": 55,
      "e": 56,
      "f": 57,
      "g": 58,
      "h": 59,
      "i": 60,
      "j": 61,
      "k": 62,
      "l": 63,
      "m": 64,
      "n": 65,
      "o": 66,
      "p": 67,
      "q": 68,
      "r": 69,
      "s": 70,
      "t": 71,
      "u": 72,
      "v": 73,
      "w": 74,
      "x": 75,
      "y": 76,
      "z": 77,
      "|": 78,
      "،": 79,
      "؟": 80,
      "ء": 81,
      "آ": 82,
      "أ": 83,
      "ؤ": 84,
      "إ": 85,
      "ئ": 86,
      "ا": 87,
      "ب": 88,
      "ة": 89,
      "ت": 90,
      "ث": 91,
      "ج": 92,
      "ح": 93,
      "خ": 94,
      "د": 95,
      "ذ": 96,
      "ر": 97,
      "ز": 98,
      "س": 99,
      "ش": 100,
      "ص": 101,
      "ض": 102,
      "ط": 103,
      "ظ": 104,
      "ع": 105,
      "غ": 106,
      "ـ": 107,
      "ف": 108,
      "ق": 109,
      "ك": 110,
      "ل": 111,
      "م": 112,
      "ن": 113,
      "ه": 114,
      "و": 115,
      "ى": 116,
      "ي": 117,
      "ً": 118,
      "ُ": 119,
      "ّ": 120,
      "ال": 121,
      "er": 122,
      "ar": 123,
      "فر": 124,
      "in": 125,
      "جع": 126,
      "جعفر": 127,
      "he": 128,
      "on": 129,
      "an": 130,
      "am": 131,
      "th": 132,
      "Ja": 133,
      "af": 134,
      "is": 135,
      "Jaaf": 136,
      "Jaafar": 137,
      "نا": 138,
      "ro": 139,
      "من": 140,
      "ور": 141,
      "في": 142,
      "ري": 143,
      "Py": 144,
      "ec": 145,
      "بر": 146,
      "thon": 147,
      "Python": 148,
      "or": 149,
      "ست": 150,
      "ve": 151,
      "عل": 152,
      "at": 153,
      "لة": 154,
      "en": 155,
      "as": 156,
      "مج": 157,
      "ou": 158,
      "ing": 159,
      "pro": 160,
      "ات": 161,
      "de": 162,
      "al": 163,
      "شه": 164,
      "لشه": 165,
      "لشهب": 166,
      "lo": 167,
      "خد": 168,
      "ورق": 169,
      "برمج": 170,
      "ورقلة": 171,
      "ed": 172,
      "ستخد": 173,
      "ic": 174,
      "أنا": 175,
      "st": 176,
      "the": 177,
      "عم": 178,
      "جز": 179,
      "and": 180,
      "la": 181,
      "ائ": 182,
      "ستخدم": 183,
      "Lec": 184,
      "heb": 185,
      "heheb": 186,
      "Lecheheb": 187,
      "arg": 188,
      "it": 189,
      "اس": 190,
      "جزائ": 191,
      "gr": 192,
      "ام": 193,
      "Ou": 194,
      "ter": 195,
      "هو": 196,
      "velo": 197,
      "argla": 198,
      "Ouargla": 199,
      "velop": 200,
      "develop": 201,
      "با": 202,
      "ني": 203,
      "us": 204,
      "اص": 205,
      "مي": 206,
      "eri": 207,
      "amm": 208,
      "gramm": 209,
      "il": 210,
      "الم": 211,
      "programm": 212,
      "دي": 213,
      "عي": 214,
      "ent": 215,
      "02": 216,
      "you": 217,
      "بي": 218,
      "تعل": 219,
      "ما": 220,
      "وي": 221,
      "Al": 222,
      "geri": 223,
      "طور": 224,
      "Algeri": 225,
      "شا": 226,
      "Fl": 227,
      "for": 228,
      "ang": 229,
      "es": 230,
      "كا": 231,
      "الجزائ": 232,
      "DZ": 233,
      "Dic": 234,
      "oDZ": 235,
      "وال": 236,
      "rom": 237,
      "DicoDZ": 238,
      "Wh": 239,
      "from": 240,
      "عمل": 241,
      "ce": 242,
      "ion": 243,
      "te": 244,
      "مستخدم": 245,
      "ask": 246,
      "ac": 247,
      "bu": 248,
      "ts": 249,
      "ذكا": 250,
      "طنا": 251,
      "مبرمج": 252,
      "اصطنا": 253,
      "ذكاء": 254,
      "اصطناعي": 255,
      "ear": 256,
      "ول": 257,
      "of": 258,
      "تط": 259,
      "عر": 260,
      "لي": 261,
      "23": 262,
      "My": 263,
      "ut": 264,
      "سي": 265,
      "على": 266,
      "ence": 267,
      "برمجة": 268,
      "nam": 269,
      "re": 270,
      "مت": 271,
      "نج": 272,
      "art": 273,
      "اسمي": 274,
      "li": 275,
      "رنج": 276,
      "شط": 277,
      "لغ": 278,
      "نة": 279,
      "وا": 280,
      "الاصطناعي": 281,
      "developer": 282,
      "buil": 283,
      "شطرنج": 284,
      "ab": 285,
      "my": 286,
      "no": 287,
      "ss": 288,
      "to": 289,
      "بني": 290,
      "كن": 291,
      "شاري": 292,
      "Flut": 293,
      "Flutter": 294,
      "Dj": 295,
      "we": 296,
      "سنة": 297,
      "مر": 298,
      "مه": 299,
      "hess": 300,
      "programmer": 301,
      "Algerian": 302,
      "ango": 303,
      "Django": 304,
      "mo": 305,
      "wor": 306,
      "مشاري": 307,
      "البرمجة": 308,
      "programming": 309,
      "الجزائر": 310,
      "build": 311,
      "202": 312,
      "He": 313,
      "ol": 314,
      "اض": 315,
      "عد": 316,
      "هي": 317,
      "رياض": 318,
      "work": 319,
      "jec": 320,
      "أت": 321,
      "خص": 322,
      "عن": 323,
      "لا": 324,
      "يات": 325,
      "ers": 326,
      "out": 327,
      "2021": 328,
      "002": 329,
      "2002": 330,
      "AI": 331,
      "ial": 332,
      "ux": 333,
      "بد": 334,
      "حب": 335,
      "الج": 336,
      "منص": 337,
      "projec": 338,
      "ity": 339,
      "جزائري": 340,
      "name": 341,
      "about": 342,
      "Co": 343,
      "ge": 344,
      "pl": 345,
      "ud": 346,
      "ur": 347,
      "تم": 348,
      "لت": 349,
      "مطور": 350,
      "الذكاء": 351,
      "ation": 352,
      "Who": 353,
      "ment": 354,
      "أس": 355,
      "رة": 356,
      "form": 357,
      "مشاريع": 358,
      "منصة": 359,
      "Sc": 360,
      "chess": 361,
      "im": 362,
      "se": 363,
      "sp": 364,
      "آلي": 365,
      "أد": 366,
      "أن": 367,
      "أستخدم": 368,
      "إعل": 369,
      "كل": 370,
      "مو": 371,
      "هل": 372,
      "ية": 373,
      "ther": 374,
      "stud": 375,
      "وير": 376,
      "Algeria": 377,
      "earn": 378,
      "تطوير": 379,
      "خصص": 380,
      "إعلام": 381,
      "me": 382,
      "أبني": 383,
      "ذا": 384,
      "لل": 385,
      "يا": 386,
      "الشطرنج": 387,
      "ويب": 388,
      "عرف": 389,
      "لغة": 390,
      "web": 391,
      "projects": 392,
      "19": 393,
      "AP": 394,
      "age": 395,
      "his": 396,
      "ase": 397,
      "تعلم": 398,
      "API": 399,
      "AM": 400,
      "Him": 401,
      "IN": 402,
      "KIN": 403,
      "TAM": 404,
      "di": 405,
      "fa": 406,
      "ho": 407,
      "learn": 408,
      "nd": 409,
      "ri": 410,
      "أست": 411,
      "تخصص": 412,
      "حسي": 413,
      "ذج": 414,
      "قاص": 415,
      "الب": 416,
      "الك": 417,
      "development": 418,
      "باح": 419,
      "use": 420,
      "your": 421,
      "تعلي": 422,
      "Flask": 423,
      "ach": 424,
      "مرباح": 425,
      "Himam": 426,
      "TAMKIN": 427,
      "حسين": 428,
      "قاصدي": 429,
      "ES": 430,
      "Git": 431,
      "LL": 432,
      "Lin": 433,
      "ap": 434,
      "ex": 435,
      "fic": 436,
      "ience": 437,
      "ll": 438,
      "mp": 439,
      "uage": 440,
      "year": 441,
      "انا": 442,
      "عة": 443,
      "قات": 444,
      "ها": 445,
      "يعمل": 446,
      "are": 447,
      "atform": 448,
      "all": 449,
      "love": 450,
      "start": 451,
      "باي": 452,
      "بيقات": 453,
      "شاب": 454,
      "anguage": 455,
      "الجزائري": 456,
      "تطبيقات": 457,
      "Science": 458,
      "LLM": 459,
      "Linux": 460,
      "BO": 461,
      "ir": 462,
      "iz": 463,
      "ith": 464,
      "ly": 465,
      "ng": 466,
      "sc": 467,
      "ser": 468,
      "uter": 469,
      "wer": 470,
      "was": 471,
      "أل": 472,
      "إذا": 473,
      "اذ": 474,
      "ار": 475,
      "اً": 476,
      "بنا": 477,
      "تر": 478,
      "تي": 479,
      "لدي": 480,
      "نعم": 481,
      "هم": 482,
      "الويب": 483,
      "ecial": 484,
      "ستخدام": 485,
      "user": 486,
      "young": 487,
      "What": 488,
      "now": 489,
      "رياضيات": 490,
      "Comp": 491,
      "platform": 492,
      "student": 493,
      "أستاذ": 494,
      "ESBO": 495,
      "exp": 496,
      "Computer": 497,
      "If": 498,
      "User": 499,
      "ave": 500,
      "base": 501,
      "co": 502,
      "et": 503,
      "gh": 504,
      "know": 505,
      "ls": 506,
      "language": 507,
      "mat": 508,
      "uc": 509,
      "und": 510,
      "ver": 511,
      "بش": 512,
      "تح": 513,
      "خبر": 514,
      "رو": 515,
      "سأل": 516,
      "كرة": 517,
      "نف": 518,
      "الأ": 519,
      "end": 520,
      "ast": 521,
      "باستخدام": 522,
      "مية": 523,
      "asks": 524,
      "building": 525,
      "بدأ": 526,
      "special": 527,
      "rip": 528,
      "تعليمية": 529,
      "started": 530,
      "بشكل": 531,
      "Fi": 532,
      "In": 533,
      "Kas": 534,
      "Mer": 535,
      "ah": 536,
      "be": 537,
      "bah": 538,
      "ch": 539,
      "do": 540,
      "ific": 541,
      "ma": 542,
      "mb": 543,
      "sion": 544,
      "swer": 545,
      "أحب": 546,
      "أتعلم": 547,
      "إل": 548,
      "حتر": 549,
      "در": 550,
      "سا": 551,
      "سلة": 552,
      "شرو": 553,
      "فض": 554,
      "فالج": 555,
      "مع": 556,
      "مشرو": 557,
      "نما": 558,
      "يق": 559,
      "answer": 560,
      "orn": 561,
      "عمر": 562,
      "امل": 563,
      "امعة": 564,
      "ile": 565,
      "ack": 566,
      "rebase": 567,
      "واب": 568,
      "old": 569,
      "رياضة": 570,
      "father": 571,
      "years": 572,
      "بايل": 573,
      "specializ": 574,
      "Firebase": 575,
      "Kasdi": 576,
      "Merbah": 577,
      "إلى": 578,
      "فالجواب": 579,
      "مشروع": 580,
      "نماذج": 581,
      "Fast": 582,
      "Hus": 583,
      "Ter": 584,
      "bers": 585,
      "ball": 586,
      "born": 587,
      "bile": 588,
      "dat": 589,
      "gence": 590,
      "have": 591,
      "lli": 592,
      "ms": 593,
      "vers": 594,
      "with": 595,
      "ybers": 596,
      "أي": 597,
      "أطور": 598,
      "أعمل": 599,
      "بت": 600,
      "بتم": 601,
      "سبتم": 602,
      "طالب": 603,
      "فهم": 604,
      "قع": 605,
      "وات": 606,
      "الرياضة": 607,
      "erst": 608,
      "inte": 609,
      "ecur": 610,
      "prof": 611,
      "educ": 612,
      "اسمه": 613,
      "using": 614,
      "المبرمج": 615,
      "تعلمت": 616,
      "teach": 617,
      "asket": 618,
      "reat": 619,
      "live": 620,
      "not": 621,
      "tool": 622,
      "mode": 623,
      "بدأت": 624,
      "أساس": 625,
      "sein": 626,
      "بناء": 627,
      "underst": 628,
      "ificial": 629,
      "FastAPI": 630,
      "Hussein": 631,
      "Term": 632,
      "lligence": 633,
      "ybersecur": 634,
      "سبتمبر": 635,
      "education": 636,
      "asketball": 637,
      "ybersecurity": 638,
      "CS": 639,
      "Chess": 640,
      "Kal": 641,
      "SCo": 642,
      "VSCo": 643,
      "back": 644,
      "ep": 645,
      "ivers": 646,
      "ne": 647,
      "nivers": 648,
      "who": 649,
      "ته": 650,
      "دس": 651,
      "رح": 652,
      "سك": 653,
      "قب": 654,
      "قن": 655,
      "كي": 656,
      "موا": 657,
      "محتر": 658,
      "ندس": 659,
      "وب": 660,
      "وف": 661,
      "وم": 662,
      "ون": 663,
      "الت": 664,
      "الذ": 665,
      "السي": 666,
      "الآلي": 667,
      "ine": 668,
      "orts": 669,
      "اتي": 670,
      "ics": 671,
      "اسم": 672,
      "erience": 673,
      "المفض": 674,
      "بيانا": 675,
      "والذكاء": 676,
      "ولو": 677,
      "named": 678,
      "mobile": 679,
      "works": 680,
      "أدوات": 681,
      "experience": 682,
      "ript": 683,
      "ساعد": 684,
      "profes": 685,
      "models": 686,
      "understand": 687,
      "Termux": 688,
      "Kali": 689,
      "VSCode": 690,
      "backend": 691,
      "niversity": 692,
      "مواقع": 693,
      "محترف": 694,
      "بيانات": 695,
      "le": 696,
      "lp": 697,
      "man": 698,
      "sit": 699,
      "ugh": 700,
      "va": 701,
      "أول": 702,
      "اب": 703,
      "ان": 704,
      "اني": 705,
      "بـ": 706,
      "ثم": 707,
      "جامعة": 708,
      "دة": 709,
      "دت": 710,
      "سكن": 711,
      "طلا": 712,
      "يد": 713,
      "يم": 714,
      "يطور": 715,
      "يبني": 716,
      "الص": 717,
      "الإعلام": 718,
      "help": 719,
      "ont": 720,
      "Java": 721,
      "براني": 722,
      "ستر": 723,
      "our": 724,
      "log": 725,
      "lay": 726,
      "كان": 727,
      "والد": 728,
      "والدي": 729,
      "عروف": 730,
      "artificial": 731,
      "well": 732,
      "مرح": 733,
      "مهندس": 734,
      "أنت": 735,
      "websit": 736,
      "الكامل": 737,
      "app": 738,
      "irst": 739,
      "known": 740,
      "الأمن": 741,
      "sional": 742,
      "أين": 743,
      "intelligence": 744,
      "teacher": 745,
      "educational": 746,
      "الذي": 747,
      "السيبراني": 748,
      "professional": 749,
      "طلاب": 750,
      "Basketball": 751,
      "Ho": 752,
      "Hu": 753,
      "Sep": 754,
      "University": 755,
      "Yes": 756,
      "creat": 757,
      "cybersecurity": 758,
      "est": 759,
      "first": 760,
      "hno": 761,
      "jour": 762,
      "kil": 763,
      "ld": 764,
      "lf": 765,
      "play": 766,
      "sm": 767,
      "skil": 768,
      "tec": 769,
      "بالجزائر": 770,
      "تو": 771,
      "تعرف": 772,
      "جيا": 773,
      "دات": 774,
      "شغ": 775,
      "طمو": 776,
      "ظم": 777,
      "عب": 778,
      "كال": 779,
      "مفر": 780,
      "مست": 781,
      "هتم": 782,
      "وأنا": 783,
      "يستخدم": 784,
      "يحب": 785,
      "الخ": 786,
      "العر": 787,
      "فريق": 788,
      "inter": 789,
      "hemat": 790,
      "anal": 791,
      "وريا": 792,
      "علوم": 793,
      "aster": 794,
      "مجال": 795,
      "ous": 796,
      "عمري": 797,
      "ite": 798,
      "بية": 799,
      "بين": 800,
      "team": 801,
      "temb": 802,
      "ولدت": 803,
      "ليل": 804,
      "كنولو": 805,
      "مشاريعي": 806,
      "أتقن": 807,
      "لاعب": 808,
      "أسكن": 809,
      "self": 810,
      "sports": 811,
      "أدر": 812,
      "موبايل": 813,
      "للمفر": 814,
      "APIs": 815,
      "learned": 816,
      "البكال": 817,
      "GitHu": 818,
      "students": 819,
      "mathemat": 820,
      "درس": 821,
      "عمره": 822,
      "specializing": 823,
      "tools": 824,
      "ney": 825,
      "رحلت": 826,
      "التكنولو": 827,
      "المفضلة": 828,
      "الصفر": 829,
      "logy": 830,
      "websites": 831,
      "Septemb": 832,
      "hnology": 833,
      "journey": 834,
      "technology": 835,
      "طموح": 836,
      "العربية": 837,
      "analy": 838,
      "للمفردات": 839,
      "البكالوريا": 840,
      "GitHub": 841,
      "mathematics": 842,
      "التكنولوجيا": 843,
      "September": 844,
      "Ar": 845,
      "HT": 846,
      "It": 847,
      "ML": 848,
      "Master": 849,
      "bo": 850,
      "cur": 851,
      "cont": 852,
      "ems": 853,
      "fr": 854,
      "ive": 855,
      "ient": 856,
      "ious": 857,
      "jor": 858,
      "ra": 859,
      "rent": 860,
      "so": 861,
      "sy": 862,
      "vor": 863,
      "ving": 864,
      "اي": 865,
      "بورقلة": 866,
      "بعد": 867,
      "جه": 868,
      "حي": 869,
      "حال": 870,
      "دري": 871,
      "داً": 872,
      "ذك": 873,
      "شم": 874,
      "شخص": 875,
      "فا": 876,
      "قو": 877,
      "لك": 878,
      "لبناء": 879,
      "معرف": 880,
      "معروف": 881,
      "نمو": 882,
      "نوب": 883,
      "ومنصة": 884,
      "وتطوير": 885,
      "وتطبيقات": 886,
      "وبايل": 887,
      "يسكن": 888,
      "الأساس": 889,
      "البيانات": 890,
      "ary": 891,
      "into": 892,
      "ame": 893,
      "rough": 894,
      "فية": 895,
      "ريبت": 896,
      "ate": 897,
      "خدم": 898,
      "برمجيات": 899,
      "ication": 900,
      "str": 901,
      "stems": 902,
      "جزء": 903,
      "develops": 904,
      "المطور": 905,
      "الموبايل": 906,
      "عيش": 907,
      "ماستر": 908,
      "متى": 909,
      "متعد": 910,
      "وار": 911,
      "مهار": 912,
      "most": 913,
      "عدة": 914,
      "project": 915,
      "Script": 916,
      "أنظم": 917,
      "thern": 918,
      "favor": 919,
      "learning": 920,
      "تخصصي": 921,
      "loves": 922,
      "خبرة": 923,
      "خبرني": 924,
      "نفس": 925,
      "Inform": 926,
      "main": 927,
      "data": 928,
      "تعلمتها": 929,
      "CSS": 930,
      "سكريبت": 931,
      "كيف": 932,
      "ابن": 933,
      "يمكن": 934,
      "JavaScript": 935,
      "كانت": 936,
      "مرحبا": 937,
      "apps": 938,
      "How": 939,
      "ested": 940,
      "smart": 941,
      "HTML": 942,
      "both": 943,
      "current": 944,
      "systems": 945,
      "دريب": 946,
      "ذكية": 947,
      "نموذج": 948,
      "متعددة": 949,
      "أنظمة": 950,
      "favorite": 951,
      "سكريبتات": 952,
      ").": 953,
      "Are": 954,
      "Bac": 955,
      "Cybersecurity": 956,
      "His": 957,
      "Learn": 958,
      "Mach": 959,
      "St": 960,
      "Te": 961,
      "au": 962,
      "abu": 963,
      "bi": 964,
      "bit": 965,
      "basketball": 966,
      "can": 967,
      "cabu": 968,
      "ding": 969,
      "fu": 970,
      "gor": 971,
      "id": 972,
      "iq": 973,
      "ied": 974,
      "igh": 975,
      "lary": 976,
      "ocabu": 977,
      "pas": 978,
      "part": 979,
      "pers": 980,
      "son": 981,
      "sou": 982,
      "sof": 983,
      "sur": 984,
      "ta": 985,
      "tw": 986,
      "tur": 987,
      "tra": 988,
      "ue": 989,
      "ure": 990,
      "vocabu": 991,
      "أبر": 992,
      "أفهم": 993,
      "إن": 994,
      "ئة": 995,
      "اد": 996,
      "اري": 997,
      "اية": 998,
      "بجعفر": 999,
      "بالذكاء": 1000,
      "تع": 1001,
      "تق": 1002,
      "تك": 1003,
      "تشم": 1004,
      "تخدم": 1005,
      "تدريب": 1006,
      "ثة": 1007,
      "ثون": 1008,
      "جداً": 1009,
      "حص": 1010,
      "خر": 1011,
      "خل": 1012,
      "زمي": 1013,
      "سط": 1014,
      "شأت": 1015,
      "عت": 1016,
      "غي": 1017,
      "كم": 1018,
      "كون": 1019,
      "لد": 1020,
      "لجعفر": 1021,
      "للت": 1022,
      "لقب": 1023,
      "مدي": 1024,
      "معلوم": 1025,
      "هنا": 1026,
      "ود": 1027,
      "ومي": 1028,
      "ومبرمج": 1029,
      "وFlask": 1030,
      "ير": 1031,
      "يعرف": 1032,
      "يومي": 1033,
      "الح": 1034,
      "العمل": 1035,
      "التعلم": 1036,
      "التعلي": 1037,
      "التح": 1038,
      "ere": 1039,
      "ert": 1040,
      "ines": 1041,
      "one": 1042,
      "ong": 1043,
      "ambit": 1044,
      "that": 1045,
      "through": 1046,
      "after": 1047,
      "ستمر": 1048,
      "ved": 1049,
      "atiq": 1050,
      "eng": 1051,
      "profic": 1052,
      "اته": 1053,
      "algor": 1054,
      "ical": 1055,
      "then": 1056,
      "developing": 1057,
      "used": 1058,
      "uses": 1059,
      "ميلا": 1060,
      "ily": 1061,
      "بير": 1062,
      "بيئة": 1063,
      "والبرمجة": 1064,
      "Where": 1065,
      "لغوي": 1066,
      "لغتي": 1067,
      "built": 1068,
      "الجامعة": 1069,
      "الجنوب": 1070,
      "plication": 1071,
      "sever": 1072,
      "studied": 1073,
      "ياً": 1074,
      "asets": 1075,
      "application": 1076,
      "بايثون": 1077,
      "ithms": 1078,
      "scrip": 1079,
      "script": 1080,
      "expert": 1081,
      "comb": 1082,
      "coding": 1083,
      "very": 1084,
      "تحليل": 1085,
      "نفسك": 1086,
      "major": 1087,
      "datasets": 1088,
      "notab": 1089,
      "قبل": 1090,
      "اسمك": 1091,
      "helped": 1092,
      "created": 1093,
      "played": 1094,
      "skills": 1095,
      "interested": 1096,
      "أدرس": 1097,
      "رحلته": 1098,
      "حالياً": 1099,
      "شخصي": 1100,
      "قوى": 1101,
      "معرفة": 1102,
      "وارزمي": 1103,
      "Informatiq": 1104,
      "currently": 1105,
      "Learning": 1106,
      "Machine": 1107,
      "full": 1108,
      "passion": 1109,
      "softw": 1110,
      "surname": 1111,
      "vocabulary": 1112,
      "أبرز": 1113,
      "تشمل": 1114,
      "خلال": 1115,
      "سطة": 1116,
      "معلومات": 1117,
      "التعليم": 1118,
      "ambitious": 1119,
      "proficient": 1120,
      "algorithms": 1121,
      "ميلادي": 1122,
      "several": 1123,
      "applications": 1124,
      "scripts": 1125,
      "scripting": 1126,
      "وارزميات": 1127,
      "Informatique": 1128,
      "software": 1129,
      "09": 1130,
      "11": 1131,
      "26": 1132,
      "And": 1133,
      "Do": 1134,
      "EN": 1135,
      "Fa": 1136,
      "Language": 1137,
      "Ma": 1138,
      "Pro": 1139,
      "Sp": 1140,
      "Tor": 1141,
      "UI": 1142,
      "Whe": 1143,
      "ay": 1144,
      "aving": 1145,
      "by": 1146,
      "bas": 1147,
      "bir": 1148,
      "cl": 1149,
      "cou": 1150,
      "cal": 1151,
      "city": 1152,
      "call": 1153,
      "du": 1154,
      "der": 1155,
      "eve": 1156,
      "eld": 1157,
      "fi": 1158,
      "fam": 1159,
      "fut": 1160,
      "go": 1161,
      "gan": 1162,
      "gave": 1163,
      "hic": 1164,
      "him": 1165,
      "hack": 1166,
      "high": 1167,
      "ipl": 1168,
      "ke": 1169,
      "llo": 1170,
      "led": 1171,
      "larg": 1172,
      "op": 1173,
      "rat": 1174,
      "sis": 1175,
      "sor": 1176,
      "sol": 1177,
      "ten": 1178,
      "tificial": 1179,
      "up": 1180,
      "university": 1181,
      "vir": 1182,
      "wn": 1183,
      "آن": 1184,
      "أح": 1185,
      "أع": 1186,
      "أعرف": 1187,
      "أفض": 1188,
      "أهتم": 1189,
      "أعيش": 1190,
      "أخبرني": 1191,
      "أقوى": 1192,
      "ؤمن": 1193,
      "إد": 1194,
      "إر": 1195,
      "إط": 1196,
      "ئي": 1197,
      "اة": 1198,
      "افي": 1199,
      "استخدم": 1200,
      "احب": 1201,
      "ارة": 1202,
      "احتر": 1203,
      "ادة": 1204,
      "استر": 1205,
      "اهتم": 1206,
      "بة": 1207,
      "بع": 1208,
      "بال": 1209,
      "بجامعة": 1210,
      "بنفس": 1211,
      "تري": 1212,
      "تست": 1213,
      "تني": 1214,
      "تعمل": 1215,
      "تقن": 1216,
      "تسكن": 1217,
      "تدرس": 1218,
      "تفا": 1219,
      "تاري": 1220,
      "ثي": 1221,
      "جر": 1222,
      "جمع": 1223,
      "حر": 1224,
      "حليل": 1225,
      "خلت": 1226,
      "خبير": 1227,
      "خوارزميات": 1228,
      "دف": 1229,
      "دائ": 1230,
      "دخلت": 1231,
      "ذاتي": 1232,
      "ذلك": 1233,
      "رك": 1234,
      "رئي": 1235,
      "زيد": 1236,
      "سلا": 1237,
      "صلت": 1238,
      "صاحب": 1239,
      "ضبا": 1240,
      "طق": 1241,
      "طني": 1242,
      "طبع": 1243,
      "عش": 1244,
      "عائ": 1245,
      "عام": 1246,
      "عالم": 1247,
      "عامل": 1248,
      "عبت": 1249,
      "فة": 1250,
      "فه": 1251,
      "فار": 1252,
      "قت": 1253,
      "قري": 1254,
      "قبي": 1255,
      "قيم": 1256,
      "كت": 1257,
      "كر": 1258,
      "كام": 1259,
      "لم": 1260,
      "لتطوير": 1261,
      "لدر": 1262,
      "لإد": 1263,
      "لعبت": 1264,
      "لقبي": 1265,
      "مث": 1266,
      "مبا": 1267,
      "موال": 1268,
      "مولو": 1269,
      "نى": 1270,
      "هدف": 1271,
      "وُ": 1272,
      "وجعفر": 1273,
      "ومن": 1274,
      "وDjango": 1275,
      "وتخصص": 1276,
      "وGit": 1277,
      "وأتعلم": 1278,
      "ين": 1279,
      "يفهم": 1280,
      "يدرس": 1281,
      "يكون": 1282,
      "يؤمن": 1283,
      "يتقن": 1284,
      "يجمع": 1285,
      "ّم": 1286,
      "المن": 1287,
      "العل": 1288,
      "الوا": 1289,
      "الرياضيات": 1290,
      "السلة": 1291,
      "النماذج": 1292,
      "الان": 1293,
      "الطلاب": 1294,
      "الأنظمة": 1295,
      "الرئي": 1296,
      "ink": 1297,
      "inal": 1298,
      "incl": 1299,
      "جعفار": 1300,
      "onge": 1301,
      "onment": 1302,
      "among": 1303,
      "think": 1304,
      "roid": 1305,
      "ريات": 1306,
      "PyTor": 1307,
      "علية": 1308,
      "envir": 1309,
      "des": 1310,
      "deep": 1311,
      "برمجية": 1312,
      "edit": 1313,
      "عميق": 1314,
      "ition": 1315,
      "اسوب": 1316,
      "grap": 1317,
      "باً": 1318,
      "باستمر": 1319,
      "المه": 1320,
      "المستخدم": 1321,
      "المشاري": 1322,
      "المرح": 1323,
      "المعروف": 1324,
      "المتو": 1325,
      "المزيد": 1326,
      "ديد": 1327,
      "بيرة": 1328,
      "تعلمه": 1329,
      "ماً": 1330,
      "ماعي": 1331,
      "ماذا": 1332,
      "ويعمل": 1333,
      "ange": 1334,
      "telligence": 1335,
      "act": 1336,
      "ache": 1337,
      "but": 1338,
      "وله": 1339,
      "ولاية": 1340,
      "ليس": 1341,
      "متخصص": 1342,
      "living": 1343,
      "lieve": 1344,
      "like": 1345,
      "لغته": 1346,
      "abic": 1347,
      "كنت": 1348,
      "مهتم": 1349,
      "moved": 1350,
      "builds": 1351,
      "Hello": 1352,
      "working": 1353,
      "أتعامل": 1354,
      "الجديد": 1355,
      "الجماعي": 1356,
      "منصات": 1357,
      "تمد": 1358,
      "لتحليل": 1359,
      "أدمج": 1360,
      "أداة": 1361,
      "أنشأت": 1362,
      "أستخدمه": 1363,
      "study": 1364,
      "للمشاريع": 1365,
      "did": 1366,
      "how": 1367,
      "hool": 1368,
      "ribut": 1369,
      "الكود": 1370,
      "الكبيرة": 1371,
      "yourself": 1372,
      "scrat": 1373,
      "school": 1374,
      "code": 1375,
      "خبرتي": 1376,
      "نفسي": 1377,
      "Intelligence": 1378,
      "began": 1379,
      "believe": 1380,
      "change": 1381,
      "does": 1382,
      "math": 1383,
      "درست": 1384,
      "specialization": 1385,
      "integr": 1386,
      "reate": 1387,
      "lives": 1388,
      "أساسي": 1389,
      "أساسيات": 1390,
      "كيفية": 1391,
      "ineer": 1392,
      "المفضل": 1393,
      "ساعدني": 1394,
      "understands": 1395,
      "many": 1396,
      "ught": 1397,
      "انتق": 1398,
      "ontend": 1399,
      "مرحلة": 1400,
      "creator": 1401,
      "شغفي": 1402,
      "مستقبل": 1403,
      "الخاص": 1404,
      "أدرب": 1405,
      "رحلتي": 1406,
      "analyt": 1407,
      "analysis": 1408,
      "Artificial": 1409,
      "Arabic": 1410,
      "contribut": 1411,
      "frame": 1412,
      "frontend": 1413,
      "جهة": 1414,
      "حيث": 1415,
      "الأساسية": 1416,
      "مهاراته": 1417,
      "يمكنك": 1418,
      "Baccal": 1419,
      "Tell": 1420,
      "aureate": 1421,
      "bio": 1422,
      "person": 1423,
      "southern": 1424,
      "taught": 1425,
      "train": 1426,
      "إنه": 1427,
      "تعتمد": 1428,
      "حصوله": 1429,
      "خرج": 1430,
      "عتبر": 1431,
      "غيير": 1432,
      "مدينة": 1433,
      "يومياً": 1434,
      "الحاسوب": 1435,
      "engineer": 1436,
      "لغوية": 1437,
      "combines": 1438,
      "notably": 1439,
      "شخصيتي": 1440,
      "أبرزها": 1441,
      "Android": 1442,
      "Father": 1443,
      "Sports": 1444,
      "When": 1445,
      "birth": 1446,
      "could": 1447,
      "field": 1448,
      "family": 1449,
      "future": 1450,
      "hacking": 1451,
      "large": 1452,
      "أفضل": 1453,
      "إطار": 1454,
      "اهتمام": 1455,
      "بالطبع": 1456,
      "تريد": 1457,
      "تستهدف": 1458,
      "تفاعلية": 1459,
      "تاريخ": 1460,
      "حرر": 1461,
      "دائماً": 1462,
      "ركة": 1463,
      "ضباط": 1464,
      "قريباً": 1465,
      "كاملة": 1466,
      "لإدارة": 1467,
      "مباريات": 1468,
      "مواليد": 1469,
      "مولود": 1470,
      "وُلد": 1471,
      "المنطق": 1472,
      "الواجهة": 1473,
      "الانضباط": 1474,
      "الرئيسي": 1475,
      "ongest": 1476,
      "PyTorch": 1477,
      "environment": 1478,
      "editor": 1479,
      "باستمرار": 1480,
      "المشاريع": 1481,
      "المرحلة": 1482,
      "المتوسطة": 1483,
      "scratch": 1484,
      "believes": 1485,
      "مستقبله": 1486,
      "framework": 1487,
      "Baccalaureate": 1488,
      "Ab": 1489,
      "Age": 1490,
      "Amb": 1491,
      "Be": 1492,
      "Bu": 1493,
      "Born": 1494,
      "City": 1495,
      "Creat": 1496,
      "De": 1497,
      "Dat": 1498,
      "Det": 1499,
      "DEN": 1500,
      "ED": 1501,
      "Every": 1502,
      "FO": 1503,
      "Flo": 1504,
      "From": 1505,
      "First": 1506,
      "GL": 1507,
      "Give": 1508,
      "IS": 1509,
      "IT": 1510,
      "IX": 1511,
      "IDEN": 1512,
      "Know": 1513,
      "LO": 1514,
      "Lo": 1515,
      "Lite": 1516,
      "Mo": 1517,
      "MIX": 1518,
      "NG": 1519,
      "Name": 1520,
      "Pl": 1521,
      "Play": 1522,
      "QLite": 1523,
      "RM": 1524,
      "RES": 1525,
      "Sou": 1526,
      "Sear": 1527,
      "SQLite": 1528,
      "Th": 1529,
      "Ten": 1530,
      "TIT": 1531,
      "You": 1532,
      "ath": 1533,
      "ail": 1534,
      "aver": 1535,
      "aily": 1536,
      "adu": 1537,
      "bec": 1538,
      "bal": 1539,
      "ble": 1540,
      "bbi": 1541,
      "bta": 1542,
      "bby": 1543,
      "car": 1544,
      "con": 1545,
      "cro": 1546,
      "ces": 1547,
      "care": 1548,
      "cipl": 1549,
      "dis": 1550,
      "dle": 1551,
      "day": 1552,
      "dition": 1553,
      "daily": 1554,
      "ew": 1555,
      "eth": 1556,
      "ete": 1557,
      "epl": 1558,
      "ever": 1559,
      "fe": 1560,
      "fou": 1561,
      "fund": 1562,
      "fast": 1563,
      "gi": 1564,
      "gn": 1565,
      "gam": 1566,
      "gen": 1567,
      "git": 1568,
      "gac": 1569,
      "give": 1570,
      "hy": 1571,
      "har": 1572,
      "hor": 1573,
      "hat": 1574,
      "has": 1575,
      "hase": 1576,
      "hund": 1577,
      "having": 1578,
      "ide": 1579,
      "ign": 1580,
      "lt": 1581,
      "lat": 1582,
      "last": 1583,
      "mm": 1584,
      "mu": 1585,
      "mor": 1586,
      "ming": 1587,
      "mpl": 1588,
      "mach": 1589,
      "master": 1590,
      "mid": 1591,
      "minal": 1592,
      "nor": 1593,
      "ned": 1594,
      "ntur": 1595,
      "od": 1596,
      "ower": 1597,
      "own": 1598,
      "obta": 1599,
      "oming": 1600,
      "ood": 1601,
      "pr": 1602,
      "pts": 1603,
      "pre": 1604,
      "pecial": 1605,
      "pend": 1606,
      "phase": 1607,
      "power": 1608,
      "red": 1609,
      "rit": 1610,
      "rongest": 1611,
      "su": 1612,
      "suc": 1613,
      "sive": 1614,
      "same": 1615,
      "saving": 1616,
      "shar": 1617,
      "ty": 1618,
      "tro": 1619,
      "targ": 1620,
      "tent": 1621,
      "twe": 1622,
      "tication": 1623,
      "ture": 1624,
      "uous": 1625,
      "udes": 1626,
      "vin": 1627,
      "vious": 1628,
      "wan": 1629,
      "wil": 1630,
      "went": 1631,
      "way": 1632,
      "whic": 1633,
      "what": 1634,
      "wide": 1635,
      "writ": 1636,
      "yon": 1637,
      "ze": 1638,
      "آفا": 1639,
      "آخر": 1640,
      "أر": 1641,
      "أص": 1642,
      "أغ": 1643,
      "أف": 1644,
      "أبي": 1645,
      "أسي": 1646,
      "أوا": 1647,
      "أكون": 1648,
      "أكت": 1649,
      "ؤال": 1650,
      "إج": 1651,
      "إذ": 1652,
      "إض": 1653,
      "ئات": 1654,
      "ئلت": 1655,
      "اخ": 1656,
      "اق": 1657,
      "ابر": 1658,
      "ايات": 1659,
      "اكل": 1660,
      "استخدام": 1661,
      "احي": 1662,
      "افية": 1663,
      "اعدة": 1664,
      "اخبرني": 1665,
      "افة": 1666,
      "بح": 1667,
      "بخ": 1668,
      "بم": 1669,
      "به": 1670,
      "بو": 1671,
      "بما": 1672,
      "بلغ": 1673,
      "بلا": 1674,
      "بأن": 1675,
      "بالشطرنج": 1676,
      "بلدي": 1677,
      "بالكامل": 1678,
      "بالتكنولوجيا": 1679,
      "بقو": 1680,
      "بلد": 1681,
      "بالجامعة": 1682,
      "بتحليل": 1683,
      "بنفسك": 1684,
      "بنى": 1685,
      "بمرحلة": 1686,
      "تص": 1687,
      "تف": 1688,
      "تى": 1689,
      "تطور": 1690,
      "تحب": 1691,
      "تساعد": 1692,
      "تعيش": 1693,
      "تخبرني": 1694,
      "تغيير": 1695,
      "ثف": 1696,
      "ثال": 1697,
      "جة": 1698,
      "جن": 1699,
      "جام": 1700,
      "جيات": 1701,
      "جان": 1702,
      "جيد": 1703,
      "جنوب": 1704,
      "حث": 1705,
      "حد": 1706,
      "حف": 1707,
      "حق": 1708,
      "حل": 1709,
      "حدي": 1710,
      "حوال": 1711,
      "حول": 1712,
      "حيات": 1713,
      "حيا": 1714,
      "حالك": 1715,
      "حتى": 1716,
      "خاص": 1717,
      "خلا": 1718,
      "خاد": 1719,
      "ختص": 1720,
      "داتي": 1721,
      "ذة": 1722,
      "ذت": 1723,
      "رت": 1724,
      "رق": 1725,
      "رته": 1726,
      "رأسي": 1727,
      "زة": 1728,
      "زن": 1729,
      "سع": 1730,
      "سق": 1731,
      "سن": 1732,
      "سري": 1733,
      "سأت": 1734,
      "سلم": 1735,
      "سأكون": 1736,
      "سؤال": 1737,
      "شئ": 1738,
      "شي": 1739,
      "شات": 1740,
      "شبا": 1741,
      "شكر": 1742,
      "شركة": 1743,
      "صل": 1744,
      "صم": 1745,
      "صان": 1746,
      "صاد": 1747,
      "ضاً": 1748,
      "طو": 1749,
      "طي": 1750,
      "طتني": 1751,
      "عف": 1752,
      "عى": 1753,
      "عتي": 1754,
      "عاي": 1755,
      "عادة": 1756,
      "فأنا": 1757,
      "فتح": 1758,
      "فكي": 1759,
      "قة": 1760,
      "قف": 1761,
      "قل": 1762,
      "قي": 1763,
      "قوا": 1764,
      "قاعدة": 1765,
      "كما": 1766,
      "كامل": 1767,
      "كود": 1768,
      "كبيئة": 1769,
      "كثي": 1770,
      "كثف": 1771,
      "لب": 1772,
      "لف": 1773,
      "لفية": 1774,
      "لحف": 1775,
      "مد": 1776,
      "منا": 1777,
      "معل": 1778,
      "مسي": 1779,
      "مكن": 1780,
      "محب": 1781,
      "مساعد": 1782,
      "مفا": 1783,
      "مقيم": 1784,
      "محرر": 1785,
      "مئات": 1786,
      "مسق": 1787,
      "مصم": 1788,
      "مطو": 1789,
      "مكثف": 1790,
      "ملف": 1791,
      "نو": 1792,
      "نتي": 1793,
      "نظم": 1794,
      "نشأت": 1795,
      "هات": 1796,
      "همت": 1797,
      "هذا": 1798,
      "وو": 1799,
      "وى": 1800,
      "واس": 1801,
      "والم": 1802,
      "وعمل": 1803,
      "وذكاء": 1804,
      "وFlutter": 1805,
      "وأت": 1806,
      "ومطور": 1807,
      "وأبني": 1808,
      "وTAMKIN": 1809,
      "وتح": 1810,
      "وFirebase": 1811,
      "ونماذج": 1812,
      "وأطور": 1813,
      "وأعمل": 1814,
      "وبناء": 1815,
      "وTermux": 1816,
      "وbackend": 1817,
      "وكان": 1818,
      "وولدت": 1819,
      "وأتقن": 1820,
      "وأسكن": 1821,
      "وموبايل": 1822,
      "وGitHub": 1823,
      "وتخصصي": 1824,
      "وCSS": 1825,
      "وJavaScript": 1826,
      "وHTML": 1827,
      "وتحليل": 1828,
      "وسطة": 1829,
      "وقت": 1830,
      "وPyTorch": 1831,
      "وTen": 1832,
      "وهذا": 1833,
      "ينا": 1834,
      "يتعل": 1835,
      "يمت": 1836,
      "يتعلم": 1837,
      "يتخصص": 1838,
      "يبدأ": 1839,
      "يسا": 1840,
      "يساعد": 1841,
      "يهتم": 1842,
      "يخدم": 1843,
      "يعيش": 1844,
      "يعش": 1845,
      "يعتبر": 1846,
      "يبلغ": 1847,
      "ّر": 1848,
      "ّف": 1849,
      "ّمه": 1850,
      "الـ": 1851,
      "النا": 1852,
      "المج": 1853,
      "الكل": 1854,
      "الذا": 1855,
      "التخصص": 1856,
      "الشاب": 1857,
      "التي": 1858,
      "الأستاذ": 1859,
      "التعليمية": 1860,
      "الاسم": 1861,
      "الشغ": 1862,
      "الفريق": 1863,
      "الحال": 1864,
      "الشم": 1865,
      "الخبرة": 1866,
      "السكريبتات": 1867,
      "اللقب": 1868,
      "الآن": 1869,
      "الإر": 1870,
      "البرمجية": 1871,
      "المنصات": 1872,
      "اللغوية": 1873,
      "الاخ": 1874,
      "الثال": 1875,
      "الشبا": 1876,
      "العف": 1877,
      "الهات": 1878,
      "الوقت": 1879,
      "erat": 1880,
      "eral": 1881,
      "arch": 1882,
      "ining": 1883,
      "inde": 1884,
      "inform": 1885,
      "insp": 1886,
      "inuous": 1887,
      "ons": 1888,
      "any": 1889,
      "ande": 1890,
      "ance": 1891,
      "ament": 1892,
      "this": 1893,
      "ism": 1894,
      "ised": 1895,
      "istent": 1896,
      "rol": 1897,
      "roll": 1898,
      "منة": 1899,
      "مني": 1900,
      "منشئ": 1901,
      "فيه": 1902,
      "فيها": 1903,
      "فيفة": 1904,
      "فيمكن": 1905,
      "ريف": 1906,
      "رين": 1907,
      "ecture": 1908,
      "vel": 1909,
      "vement": 1910,
      "ventur": 1911,
      "عله": 1912,
      "علمت": 1913,
      "علّم": 1914,
      "ates": 1915,
      "ened": 1916,
      "enter": 1917,
      "enroll": 1918,
      "proble": 1919,
      "provin": 1920,
      "provement": 1921,
      "اتك": 1922,
      "اتية": 1923,
      "اتذة": 1924,
      "deepl": 1925,
      "als": 1926,
      "ality": 1927,
      "also": 1928,
      "alway": 1929,
      "شهادة": 1930,
      "ورقلي": 1931,
      "ice": 1932,
      "stri": 1933,
      "them": 1934,
      "عمق": 1935,
      "جزاي": 1936,
      "itecture": 1937,
      "اسة": 1938,
      "gradu": 1939,
      "grew": 1940,
      "terested": 1941,
      "terminal": 1942,
      "هوية": 1943,
      "هواية": 1944,
      "هوايات": 1945,
      "veloper": 1946,
      "developed": 1947,
      "باختص": 1948,
      "نياته": 1949,
      "grammer": 1950,
      "ilder": 1951,
      "المشا": 1952,
      "المتخصص": 1953,
      "المستمر": 1954,
      "الماستر": 1955,
      "المحرر": 1956,
      "ديف": 1957,
      "ديات": 1958,
      "ديني": 1959,
      "ديداً": 1960,
      "عيد": 1961,
      "تعلّم": 1962,
      "تعلمني": 1963,
      "ويطور": 1964,
      "ويبني": 1965,
      "ويحب": 1966,
      "ويعتبر": 1967,
      "شاركة": 1968,
      "fore": 1969,
      "especial": 1970,
      "والعمل": 1971,
      "والشطرنج": 1972,
      "والإعلام": 1973,
      "والرياضة": 1974,
      "والاحتر": 1975,
      "والخوارزميات": 1976,
      "والعش": 1977,
      "والخاد": 1978,
      "عملت": 1979,
      "عمله": 1980,
      "عملي": 1981,
      "cepts": 1982,
      "ions": 1983,
      "teache": 1984,
      "ولا": 1985,
      "ولد": 1986,
      "ولاي": 1987,
      "عرعت": 1988,
      "عرّف": 1989,
      "لية": 1990,
      "ليلية": 1991,
      "utions": 1992,
      "سيتك": 1993,
      "rely": 1994,
      "reache": 1995,
      "متوار": 1996,
      "متخرج": 1997,
      "متنو": 1998,
      "متوسطة": 1999,
      "نجاحي": 2000,
      "arted": 2001,
      "lid": 2002,
      "ligh": 2003,
      "life": 2004,
      "لغتك": 2005,
      "واحد": 2006,
      "developers": 2007,
      "town": 2008,
      "بنية": 2009,
      "بنيت": 2010,
      "weap": 2011,
      "مررت": 2012,
      "programmers": 2013,
      "moder": 2014,
      "world": 2015,
      "builder": 2016,
      "2025": 2017,
      "عدل": 2018,
      "هيم": 2019,
      "هياكل": 2020,
      "رياضي": 2021,
      "worked": 2022,
      "jects": 2023,
      "عنه": 2024,
      "عندي": 2025,
      "بداي": 2026,
      "uding": 2027,
      "udent": 2028,
      "تمع": 2029,
      "لتنا": 2030,
      "أسئلت": 2031,
      "أسعى": 2032,
      "أسهمت": 2033,
      "أساتذة": 2034,
      "مشاريعك": 2035,
      "مشاريعه": 2036,
      "improvement": 2037,
      "أنه": 2038,
      "كلها": 2039,
      "موقع": 2040,
      "موطني": 2041,
      "there": 2042,
      "memor": 2043,
      "metown": 2044,
      "لله": 2045,
      "للشطرنج": 2046,
      "للبيانات": 2047,
      "للطلاب": 2048,
      "للموبايل": 2049,
      "للإج": 2050,
      "للمتوسطة": 2051,
      "عرفني": 2052,
      "agement": 2053,
      "dived": 2054,
      "digit": 2055,
      "hobby": 2056,
      "hometown": 2057,
      "ndation": 2058,
      "أستسلم": 2059,
      "أستطي": 2060,
      "تخصصك": 2061,
      "تخصصاتي": 2062,
      "الكبير": 2063,
      "الكثي": 2064,
      "acher": 2065,
      "exten": 2066,
      "mpany": 2067,
      "alleng": 2068,
      "الجزائريين": 2069,
      "ired": 2070,
      "ization": 2071,
      "izons": 2072,
      "scient": 2073,
      "serve": 2074,
      "were": 2075,
      "ألهم": 2076,
      "بناك": 2077,
      "بناه": 2078,
      "بناني": 2079,
      "تراق": 2080,
      "ترعرعت": 2081,
      "لديك": 2082,
      "لديه": 2083,
      "platforms": 2084,
      "expande": 2085,
      "compl": 2086,
      "company": 2087,
      "eting": 2088,
      "uctur": 2089,
      "تحصلت": 2090,
      "تحديداً": 2091,
      "رون": 2092,
      "نفذت": 2093,
      "الأول": 2094,
      "الأجه": 2095,
      "الأقوى": 2096,
      "الأخلا": 2097,
      "specialty": 2098,
      "Intro": 2099,
      "Interested": 2100,
      "best": 2101,
      "before": 2102,
      "challeng": 2103,
      "doing": 2104,
      "ساكن": 2105,
      "يقول": 2106,
      "يقية": 2107,
      "عمرك": 2108,
      "specialized": 2109,
      "specializes": 2110,
      "مشروعك": 2111,
      "date": 2112,
      "version": 2113,
      "أيضاً": 2114,
      "بتجر": 2115,
      "profile": 2116,
      "المبرمجون": 2117,
      "teachers": 2118,
      "model": 2119,
      "understood": 2120,
      "Terminal": 2121,
      "new": 2122,
      "never": 2123,
      "قبلي": 2124,
      "وبنى": 2125,
      "ومقيم": 2126,
      "ومشاركة": 2127,
      "التفكي": 2128,
      "التعمق": 2129,
      "الذاتية": 2130,
      "السيرة": 2131,
      "اتيجيات": 2132,
      "ساعدته": 2133,
      "ساعدتني": 2134,
      "professor": 2135,
      "understanding": 2136,
      "محترفاً": 2137,
      "lete": 2138,
      "legac": 2139,
      "level": 2140,
      "management": 2141,
      "ابة": 2142,
      "ابحث": 2143,
      "بـC": 2144,
      "بـFlutter": 2145,
      "بـDjango": 2146,
      "يدمج": 2147,
      "الصغي": 2148,
      "helps": 2149,
      "logical": 2150,
      "والدك": 2151,
      "والده": 2152,
      "مهندساً": 2153,
      "website": 2154,
      "professionalism": 2155,
      "Hobbi": 2156,
      "player": 2157,
      "small": 2158,
      "skill": 2159,
      "skilled": 2160,
      "توجه": 2161,
      "توسع": 2162,
      "توقف": 2163,
      "شغوف": 2164,
      "شغفه": 2165,
      "مستقل": 2166,
      "مستوى": 2167,
      "مستقبلي": 2168,
      "يستخدمها": 2169,
      "الخوارزميات": 2170,
      "الخلفية": 2171,
      "الخفيفة": 2172,
      "interest": 2173,
      "interact": 2174,
      "بينهم": 2175,
      "teamwork": 2176,
      "أتقنت": 2177,
      "طموحة": 2178,
      "analyze": 2179,
      "continuous": 2180,
      "control": 2181,
      "raised": 2182,
      "soon": 2183,
      "solid": 2184,
      "معرفته": 2185,
      "الأساسي": 2186,
      "ategi": 2187,
      "strong": 2188,
      "strongest": 2189,
      "structur": 2190,
      "strategi": 2191,
      "المطورين": 2192,
      "مهاراتي": 2193,
      "مهاراتك": 2194,
      "نفسه": 2195,
      "Information": 2196,
      "يمكنني": 2197,
      "مرحباً": 2198,
      "نموذجي": 2199,
      "Strongest": 2200,
      "Started": 2201,
      "Student": 2202,
      "Teacher": 2203,
      "authen": 2204,
      "ight": 2205,
      "persistent": 2206,
      "south": 2207,
      "turned": 2208,
      "tradition": 2209,
      "ادته": 2210,
      "اريد": 2211,
      "تعريف": 2212,
      "تقنياته": 2213,
      "حصلت": 2214,
      "للتحسين": 2215,
      "للتدريب": 2216,
      "للتغيير": 2217,
      "لقبك": 2218,
      "لقبه": 2219,
      "مدينتي": 2220,
      "هناك": 2221,
      "يعرفه": 2222,
      "الحمد": 2223,
      "التحق": 2224,
      "التحقت": 2225,
      "التحديات": 2226,
      "combine": 2227,
      "majored": 2228,
      "notable": 2229,
      "passionate": 2230,
      "خلاله": 2231,
      "ENGL": 2232,
      "Math": 2233,
      "Major": 2234,
      "Programmer": 2235,
      "Projects": 2236,
      "based": 2237,
      "basics": 2238,
      "calls": 2239,
      "duce": 2240,
      "got": 2241,
      "himself": 2242,
      "highly": 2243,
      "iple": 2244,
      "ledge": 2245,
      "operat": 2246,
      "opened": 2247,
      "sorFlo": 2248,
      "solve": 2249,
      "solutions": 2250,
      "أحل": 2251,
      "أحلل": 2252,
      "أعطني": 2253,
      "أعطتني": 2254,
      "إرادته": 2255,
      "افيك": 2256,
      "استخدمت": 2257,
      "احترافي": 2258,
      "استراتيجيات": 2259,
      "بنفسه": 2260,
      "جرافيك": 2261,
      "سلاح": 2262,
      "سلاحي": 2263,
      "عائلة": 2264,
      "عائلتنا": 2265,
      "فهمت": 2266,
      "كتبت": 2267,
      "لدرجة": 2268,
      "لدراسة": 2269,
      "مثل": 2270,
      "مثابر": 2271,
      "وتخصصت": 2272,
      "العلم": 2273,
      "العلمي": 2274,
      "includes": 2275,
      "including": 2276,
      "thinking": 2277,
      "design": 2278,
      "graphic": 2279,
      "graphy": 2280,
      "المهني": 2281,
      "المهندس": 2282,
      "تعلمها": 2283,
      "actice": 2284,
      "integrate": 2285,
      "integrates": 2286,
      "انتقل": 2287,
      "انتقلت": 2288,
      "analytics": 2289,
      "analytical": 2290,
      "contributed": 2291,
      "contributes": 2292,
      "biography": 2293,
      "personality": 2294,
      "birthday": 2295,
      "اهتمامه": 2296,
      "اهتماماتي": 2297,
      "المنطقة": 2298,
      "المنطقي": 2299,
      "About": 2300,
      "Ambition": 2301,
      "Beyon": 2302,
      "Builder": 2303,
      "Creator": 2304,
      "Developer": 2305,
      "Data": 2306,
      "Detail": 2307,
      "Everyone": 2308,
      "FORM": 2309,
      "ISH": 2310,
      "IDENTIT": 2311,
      "Knowledge": 2312,
      "LONG": 2313,
      "Lover": 2314,
      "Mobile": 2315,
      "MIXED": 2316,
      "Platform": 2317,
      "Player": 2318,
      "REST": 2319,
      "Southern": 2320,
      "Search": 2321,
      "Through": 2322,
      "athlete": 2323,
      "average": 2324,
      "becoming": 2325,
      "balance": 2326,
      "cares": 2327,
      "concepts": 2328,
      "cross": 2329,
      "cess": 2330,
      "career": 2331,
      "cipline": 2332,
      "discipline": 2333,
      "ethical": 2334,
      "foundation": 2335,
      "fundament": 2336,
      "games": 2337,
      "general": 2338,
      "horizons": 2339,
      "hundred": 2340,
      "ltiple": 2341,
      "later": 2342,
      "mmary": 2343,
      "multiple": 2344,
      "machines": 2345,
      "mastered": 2346,
      "middle": 2347,
      "northern": 2348,
      "obtaining": 2349,
      "practice": 2350,
      "previous": 2351,
      "pendent": 2352,
      "summary": 2353,
      "success": 2354,
      "sively": 2355,
      "sharing": 2356,
      "targeting": 2357,
      "tweight": 2358,
      "want": 2359,
      "will": 2360,
      "which": 2361,
      "written": 2362,
      "آفاق": 2363,
      "أردت": 2364,
      "أصبح": 2365,
      "أغلب": 2366,
      "أفعله": 2367,
      "أوازن": 2368,
      "أكتب": 2369,
      "إذن": 2370,
      "إضافة": 2371,
      "استخدامها": 2372,
      "بخير": 2373,
      "بمعدل": 2374,
      "بوت": 2375,
      "بقوة": 2376,
      "بلده": 2377,
      "تفكر": 2378,
      "تطوره": 2379,
      "جنسيتك": 2380,
      "جامعتي": 2381,
      "جانب": 2382,
      "حقيقية": 2383,
      "حلول": 2384,
      "حديثة": 2385,
      "حوالي": 2386,
      "حياتي": 2387,
      "حياة": 2388,
      "خاصة": 2389,
      "رقمنة": 2390,
      "سنوات": 2391,
      "سريعة": 2392,
      "سأتخرج": 2393,
      "شيء": 2394,
      "شكراً": 2395,
      "صلبة": 2396,
      "صانع": 2397,
      "صادقة": 2398,
      "عايش": 2399,
      "قواعد": 2400,
      "كثيرة": 2401,
      "لحفظ": 2402,
      "مناداتي": 2403,
      "معلّمه": 2404,
      "مسيرته": 2405,
      "مساعدتك": 2406,
      "مفاهيم": 2407,
      "محررى": 2408,
      "مسقط": 2409,
      "مصمم": 2410,
      "مطوّر": 2411,
      "ووصلت": 2412,
      "واسعة": 2413,
      "والمصادقة": 2414,
      "وأتخصص": 2415,
      "وتحليلية": 2416,
      "وأتقنها": 2417,
      "وتحليلات": 2418,
      "وTensorFlo": 2419,
      "يناديني": 2420,
      "يتعلق": 2421,
      "يمتلك": 2422,
      "يساهم": 2423,
